[
    {
      "id": "Artistic_Agreeableness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a creative and enthusiastic energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.\n",
      "recommendedCareers": [
        {
          "onetCode": "27-1024.00",
          "link": "",
          "description": "Create visual concepts to communicate ideas and captivate consumers.",
          "title": "Graphic Designer"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "21-1094.00",
          "link": "",
          "description": "Engage with the community to promote services, build relationships, and foster support for the organization's initiatives.",
          "title": "Community Outreach Coordinator"
        },
        {
          "onetCode": "21-1021.00",
          "link": "",
          "description": "Provide support and resources to individuals and families in need, addressing various social issues.",
          "title": "Social Worker"
        },
        {
          "onetCode": "13-1161.00",
          "link": "",
          "description": "Develop and implement marketing strategies to promote organizations, products, and services.",
          "title": "Marketing Specialist"
        },
        {
          "onetCode": "27-1014.00",
          "link": "",
          "description": "Create animation and visual effects for media such as television, movies, and video games.",
          "title": "Multimedia Artist and Animator"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Creative Idealist, you are passionate about using your creativity to promote positive change and advocate for causes you believe in. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Creative Idealist",
      "areasToImprove": "\n- Practicality: Balance your visionary ideas with practical steps to implement them.\n- Time Management: Ensure you allocate enough time to complete your projects.\n- Feedback Reception: Learn to accept and use constructive criticism to improve your work.\n",
      "personalGoals": [
        "Practice Practicality: Break down your visionary ideas into actionable steps.",
        "Improve Time Management: Allocate enough time to complete your projects.",
        "Enhance Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs a Creative Idealist, you enjoy sharing your ideas and inspiring others through your art. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your work.\n\n**Communicating with Friends:** Your friends appreciate your creativity and vision. Make sure to listen to their ideas and build on them together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your imagination and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints.\n\n**Effective Communication:** Use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.\n",
      "closing": "Remember, these are just suggestions based on your Creative Idealist personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "\nYou thrive in environments where you can be creative and explore new ideas. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, and media production companies.\n",
      "inspirationalQuotes": [
        {
          "quote": "I paint myself because I am so often alone and because I am the subject I know best.",
          "avatarURL": "",
          "name": "Frida Kahlo",
          "description": "A renowned painter known for her surreal and vibrant works, Frida Kahlo's art was deeply personal and imaginative."
        },
        {
          "quote": "I found I could say things with color and shapes that I couldn’t say any other way—things I had no words for.",
          "avatarURL": "",
          "name": "Georgia O'Keeffe",
          "description": "An influential artist known for her distinct paintings of flowers and southwestern landscapes, Georgia O'Keeffe's work exemplifies the power of visual communication."
        },
        {
          "quote": "There are 360 degrees, so why stick to one?",
          "avatarURL": "",
          "name": "Zaha Hadid",
          "description": "A visionary architect known for her innovative and futuristic designs, Zaha Hadid challenged traditional architectural norms with her imaginative approach."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love visual creativity.",
          "title": "Associate’s Degree in Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and promoting public images.",
          "title": "Certificate in Public Relations"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy writing persuasive content.",
          "title": "Diploma in Copywriting"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring marketing specialists.",
          "title": "Training Program in Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in creating animations and visual effects.",
          "title": "Certificate in Multimedia Arts"
        }
      ],
      "whatItMeans": "Being a Creative Idealist means you are characterized by high levels of **Openness** and an **Artistic** approach. **Openness** refers to being imaginative, curious, and open to new experiences. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and design.",
      "recommendedCareersOpening": "As a Creative Idealist, your creativity and passion for advocacy make you perfect for roles that involve communication, design, and promoting positive change.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn the principles of visual communication and design.",
          "cipCodes": [
            "5004"
          ],
          "title": "Graphic Design"
        },
        {
          "link": "",
          "description": "Study how to manage and promote the public image of organizations.",
          "cipCodes": [
            "909"
          ],
          "title": "Public Relations"
        },
        {
          "link": "",
          "description": "Develop strategies to promote products and services effectively.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "cipCodes": [
            "2313"
          ],
          "description": "Hone your skills in writing fiction, poetry, and creative non-fiction.",
          "title": "Creative Writing"
        },
        {
          "link": "",
          "description": "Explore various forms of communication and their impact on society.",
          "cipCodes": [
            "901",
            "902"
          ],
          "title": "Communication Studies"
        }
      ],
      "superpowers": " - Visionary Thinking: You can see the potential for a better future and inspire others to work towards it. - Empathy: Your ability to understand and share the feelings of others helps you create relatable and impactful messages. - Creativity: You excel at generating new and original ideas that convey deep emotions. - Passion: Your enthusiasm for your causes and creative endeavors inspires those around you. "
    },
    {
      "id": "Artistic_Conscientiousness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a creative and enthusiastic energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.\n",
      "recommendedCareers": [
        {
          "onetCode": "27-1024.00",
          "link": "",
          "description": "Create visual concepts to communicate ideas and captivate consumers.",
          "title": "Graphic Designer"
        },
        {
          "onetCode": "27-1025.00",
          "link": "",
          "description": "Plan and design interior spaces to be functional and aesthetically pleasing.",
          "title": "Interior Designer"
        },
        {
          "onetCode": "27-1022.00",
          "link": "",
          "description": "Design clothing and accessories, considering fashion trends and functionality.",
          "title": "Fashion Designer"
        },
        {
          "onetCode": "27-1014.00",
          "link": "",
          "description": "Create animation and visual effects for media such as television, movies, and video games.",
          "title": "Multimedia Artist and Animator"
        },
        {
          "onetCode": "27-1021.00",
          "link": "",
          "description": "Develop concepts for manufactured products, combining art, business, and engineering.",
          "title": "Industrial Designer"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Imaginative Designer, you excel at creating detailed and imaginative designs that bring ideas to life. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Imaginative Designer",
      "areasToImprove": "\n- Practicality: Balance your imaginative ideas with practical steps to implement them.\n- Time Management: Ensure you allocate enough time to complete your projects.\n- Collaboration: Engage with others to bring your ideas to life and benefit from different perspectives.\n",
      "personalGoals": [
        "Practice Practicality: Break down your visionary ideas into actionable steps.",
        "Improve Time Management: Allocate enough time to complete your projects.",
        "Enhance Collaboration: Work with others to bring your ideas to life and gain new insights.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs an Imaginative Designer, you enjoy sharing your ideas and inspiring others. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your designs.\n\n**Communicating with Friends:** Your friends appreciate your creativity and vision. Make sure to listen to their ideas and build on them together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your imagination and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints.\n\n**Effective Communication:** When communicating your complex ideas, use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.\n",
      "closing": "Remember, these are just suggestions based on your Imaginative Designer personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "\nYou thrive in environments where you can be creative and explore new ideas. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, and innovative startups.\n",
      "inspirationalQuotes": [
        {
          "quote": "I paint myself because I am so often alone and because I am the subject I know best.",
          "avatarURL": "",
          "name": "Frida Kahlo",
          "description": "A renowned painter known for her surreal and vibrant works, Frida Kahlo's art was deeply personal and imaginative."
        },
        {
          "quote": "I found I could say things with color and shapes that I couldn’t say any other way—things I had no words for.",
          "avatarURL": "",
          "name": "Georgia O'Keeffe",
          "description": "An influential artist known for her distinct paintings of flowers and southwestern landscapes, Georgia O'Keeffe's work exemplifies the power of visual communication."
        },
        {
          "quote": "There are 360 degrees, so why stick to one?",
          "avatarURL": "",
          "name": "Zaha Hadid",
          "description": "A visionary architect known for her innovative and futuristic designs, Zaha Hadid challenged traditional architectural norms with her imaginative approach."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love visual creativity.",
          "title": "Associate’s Degree in Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in planning and designing interior spaces.",
          "title": "Certificate in Interior Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to create clothing and accessories.",
          "title": "Diploma in Fashion Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring animators and multimedia artists.",
          "title": "Training Program in Animation"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in designing products.",
          "title": "Certificate in Industrial Design"
        }
      ],
      "whatItMeans": "Being an Imaginative Designer means you are characterized by high levels of **Openness** and an **Artistic** approach. **Openness** refers to being imaginative, curious, and open to new experiences. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and design.",
      "recommendedCareersOpening": "As an Imaginative Designer, your creativity and attention to detail make you perfect for roles that involve innovation, design, and artistic expression.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn the principles of visual communication and design.",
          "cipCodes": [
            "5004"
          ],
          "title": "Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [
            "5005"
          ],
          "description": "Study how to create functional and aesthetically pleasing interior spaces.",
          "title": "Interior Design"
        },
        {
          "link": "",
          "description": "Focus on designing clothing and accessories.",
          "cipCodes": [
            "5007"
          ],
          "title": "Fashion Design"
        },
        {
          "link": "",
          "description": "Explore the art and technology of creating animations.",
          "cipCodes": [
            "5008"
          ],
          "title": "Animation"
        },
        {
          "link": "",
          "cipCodes": [
            "5006"
          ],
          "description": "Develop skills in designing and developing concepts for manufactured products.",
          "title": "Industrial Design"
        }
      ],
      "superpowers": " - Creativity: You excel at generating new and original designs. - Attention to Detail: Your meticulous nature ensures your designs are both beautiful and functional. - Imagination: Your rich inner world allows you to see possibilities that others might miss. - Visual Communication: You have a knack for conveying ideas through visual mediums. "
    },
    {
      "id": "Artistic_Emotional-Stability",
      "relationshipTips": "In friendships and teamwork, you bring a creative and steady energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.",
      "recommendedCareers": [
        {
          "onetCode": "27-1024.00",
          "link": "",
          "description": "Create visual concepts to communicate ideas and captivate consumers.",
          "title": "Graphic Designer"
        },
        {
          "onetCode": "27-1025.00",
          "link": "",
          "description": "Plan and design interior spaces to be functional and aesthetically pleasing.",
          "title": "Interior Designer"
        },
        {
          "onetCode": "27-1022.00",
          "link": "",
          "description": "Design clothing and accessories, considering fashion trends and functionality.",
          "title": "Fashion Designer"
        },
        {
          "onetCode": "27-1014.00",
          "link": "",
          "description": "Create animation and visual effects for media such as television, movies, and video games.",
          "title": "Multimedia Artist and Animator"
        },
        {
          "onetCode": "29-1125.00",
          "link": "",
          "description": "Use art as a form of therapy to help clients express emotions and improve their mental health.",
          "title": "Art Therapist"
        },
        {
          "onetCode": "11-9151.00",
          "link": "",
          "description": "Develop and manage programs that support the organization's mission and goals.",
          "title": "Nonprofit Program Coordinator"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Resilient Creator, you approach art with a unique and stable mindset. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Resilient Creator",
      "areasToImprove": "* Flexibility: Be open to different approaches and solutions.\n* Collaboration: Engage with others to bring your ideas to life and benefit from different perspectives.\n* Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
      "personalGoals": [
        "* Practice Flexibility: Be open to different approaches and solutions.",
        "* Improve Collaboration: Work with others to bring your ideas to life and gain new insights.",
        "* Enhance Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
        "* Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "closing": "Remember, these are just suggestions based on your Resilient Creator personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "* Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "* Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "* Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "You thrive in environments where you can be creative and explore new ideas. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, and media production companies.",
      "inspirationalQuotes": [
        {
          "quote": "You can’t use up creativity. The more you use, the more you have.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "A renowned author and poet who emphasized the importance of creativity and perseverance in overcoming challenges."
        },
        {
          "quote": "What you do makes a difference, and you have to decide what kind of difference you want to make.",
          "avatarURL": "",
          "name": "Jane Goodall",
          "description": "A primatologist and anthropologist known for her groundbreaking research on chimpanzees and her dedication to conservation and animal welfare."
        },
        {
          "quote": "I found I could say things with color and shapes that I couldn’t say any other way—things I had no words for.",
          "avatarURL": "",
          "name": "Georgia O'Keeffe",
          "description": "An influential artist known for her distinct paintings of flowers and southwestern landscapes, Georgia O'Keeffe's work exemplifies the power of visual communication."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love visual creativity.",
          "title": "Associate’s Degree in Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in planning and designing interior spaces.",
          "title": "Certificate in Interior Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to create clothing and accessories.",
          "title": "Diploma in Fashion Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring animators and multimedia artists.",
          "title": "Training Program in Animation"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in using art to help others.",
          "title": "Certificate in Art Therapy"
        }
      ],
      "whatItMeans": "Being a Resilient Creator means you are characterized by high levels of **Emotional Stability** and an **Artistic** approach. **Emotional Stability** refers to being calm, resilient, and composed under pressure. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and design.",
      "recommendedCareersOpening": "As a Resilient Creator, your creativity and calm demeanor make you perfect for roles that involve innovation, design, and artistic expression.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5004"
          ],
          "description": "Learn the principles of visual communication and design.",
          "title": "Graphic Design"
        },
        {
          "link": "",
          "description": "Study how to create functional and aesthetically pleasing interior spaces.",
          "cipCodes": [
            "5005"
          ],
          "title": "Interior Design"
        },
        {
          "link": "",
          "description": "Focus on designing clothing and accessories.",
          "cipCodes": [
            "5007"
          ],
          "title": "Fashion Design"
        },
        {
          "link": "",
          "cipCodes": [
            "5008"
          ],
          "description": "Explore the art and technology of creating animations.",
          "title": "Animation"
        },
        {
          "link": "",
          "cipCodes": [
            "5117"
          ],
          "description": "Combine psychology and art to help people express themselves and heal.",
          "title": "Art Therapy"
        }
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends appreciate your creativity and calm demeanor. Make sure to listen to their ideas and build on them together.* **Communicating in Romantic Relationships**: In romantic relationships, your imagination and resilience are key strengths. Ensure you also express your feelings and understand your partner’s emotions.* **Communicating with Family**: Your family values your innovative ideas and steady presence. Share your visions with them and also take time to understand their viewpoints.* **Effective Communication**: When communicating your complex ideas, use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.",
      "superpowers": " - Emotional Resilience: You stay calm and composed, even in stressful situations, allowing you to think clearly. - Creativity: You excel at generating new and original works that convey deep emotions. - Unique Perspective: Your stable mindset helps you see the world in unique ways and translate that into your art. - Persistence: You are determined and keep going, even when faced with challenges. "
    },
    {
      "id": "Artistic_Extraversion",
      "relationshipTips": "\nIn friendships and teamwork, you bring a creative and enthusiastic energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.\n",
      "recommendedCareers": [
        {
          "onetCode": "27-1024.00",
          "link": "",
          "description": "Create visual concepts to communicate ideas and captivate consumers.",
          "title": "Graphic Designer"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "27-3043.00",
          "link": "",
          "description": "Write compelling and persuasive content for advertisements, websites, and other media.",
          "title": "Copywriter"
        },
        {
          "onetCode": "13-1161.00",
          "link": "",
          "description": "Develop and implement marketing strategies to promote products and services.",
          "title": "Marketing Specialist"
        },
        {
          "onetCode": "27-1014.00",
          "link": "",
          "description": "Create animation and visual effects for media such as television, movies, and video games.",
          "title": "Multimedia Artist and Animator"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Expressive Communicator, you use your artistic talents to convey emotions and ideas in compelling ways. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Expressive Communicator",
      "areasToImprove": "\n- Practicality: Balance your creative ideas with practical steps to implement them.\n- Organization: Develop strategies to keep your projects on track and meet deadlines.\n- Feedback Reception: Learn to accept and use constructive criticism to improve your work.\n",
      "personalGoals": [
        "Practice Practicality: Break down your visionary ideas into actionable steps.",
        "Improve Organization: Develop strategies to keep your projects on track and meet deadlines.",
        "Enhance Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs an Expressive Communicator, you enjoy sharing your ideas and inspiring others through your art. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your work.\n\n**Communicating with Friends:** Your friends appreciate your creativity and ability to express yourself. Make sure to listen to their ideas and build on them together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your imagination and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints.\n\n**Effective Communication:** Use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.\n",
      "closing": "Remember, these are just suggestions based on your Expressive Communicator personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "\nYou thrive in environments where you can be creative and explore new ideas. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, and media production companies.\n",
      "inspirationalQuotes": [
        {
          "quote": "You can’t use up creativity. The more you use, the more you have.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "A renowned author and poet who emphasized the importance of creativity and perseverance in overcoming challenges."
        },
        {
          "quote": "The biggest adventure you can take is to live the life of your dreams.",
          "avatarURL": "",
          "name": "Oprah Winfrey",
          "description": "A media mogul and philanthropist known for her inspirational leadership and ability to motivate others to pursue their dreams."
        },
        {
          "quote": "If there's a book that you want to read, but it hasn't been written yet, then you must write it.",
          "avatarURL": "",
          "name": "Toni Morrison",
          "description": "A celebrated author and Nobel Prize winner, known for her imaginative storytelling and profound insights into the human experience."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love visual creativity.",
          "title": "Associate’s Degree in Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and promoting public images.",
          "title": "Certificate in Public Relations"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy writing persuasive content.",
          "title": "Diploma in Copywriting"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring marketing specialists.",
          "title": "Training Program in Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in creating animations and visual effects.",
          "title": "Certificate in Multimedia Arts"
        }
      ],
      "whatItMeans": "Being an Expressive Communicator means you are characterized by high levels of **Openness** and an **Artistic** approach. **Openness** refers to being imaginative, curious, and open to new experiences. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and communication.",
      "recommendedCareersOpening": "As an Expressive Communicator, your creativity and ability to convey emotions through art make you perfect for roles that involve communication, design, and artistic expression.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5004"
          ],
          "description": "Learn the principles of visual communication and design.",
          "title": "Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [
            "909"
          ],
          "description": "Study how to manage and promote the public image of organizations.",
          "title": "Public Relations"
        },
        {
          "link": "",
          "description": "Develop strategies to promote products and services effectively.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "cipCodes": [
            "2313"
          ],
          "description": "Hone your skills in writing fiction, poetry, and creative non-fiction.",
          "title": "Creative Writing"
        },
        {
          "link": "",
          "cipCodes": [
            "901",
            "902"
          ],
          "description": "Explore various forms of communication and their impact on society.",
          "title": "Communication Studies"
        }
      ],
      "superpowers": " - Creativity: You excel at creating new and original works that convey deep emotions. - Empathy: Your ability to understand and share the feelings of others helps you create relatable and impactful messages. - Persuasive Communication: You can effectively convey your ideas and persuade others through your artistic expression. - Passion: Your enthusiasm and passion for your craft inspire those around you. "
    },
    {
      "id": "Artistic_Openness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a creative and enthusiastic energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.\n",
      "recommendedCareers": [
        {
          "onetCode": "27-1011.00",
          "link": "",
          "description": "Oversee the creative process in advertising, marketing, or media production.",
          "title": "Creative Director"
        },
        {
          "onetCode": "27-1021.00",
          "link": "",
          "description": "Develop new products and improve existing ones with innovative designs.",
          "title": "Product Designer"
        },
        {
          "onetCode": "27-1011.00",
          "link": "",
          "description": "Lead visual concept development for magazines, newspapers, product packaging, and film productions.",
          "title": "Art Director"
        },
        {
          "onetCode": "11-2021.00",
          "link": "",
          "description": "Create and execute marketing strategies to promote products and services.",
          "title": "Marketing Manager"
        },
        {
          "onetCode": "27-2012.00",
          "link": "",
          "description": "Direct the making of films and ensure the creative vision is realized.",
          "title": "Film Director"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Innovative Visionary, you bring creative ideas to life and inspire others with your imaginative thinking. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Innovative Visionary",
      "areasToImprove": "\n- Practicality: Balance your visionary ideas with practical steps to implement them.\n- Focus: Concentrate on one project at a time to ensure completion.\n- Collaboration: Engage with others to bring your ideas to life and benefit from different perspectives.\n",
      "personalGoals": [
        "Practice Practicality: Break down your visionary ideas into actionable steps.",
        "Improve Focus: Concentrate on completing one project at a time.",
        "Enhance Collaboration: Work with others to bring your ideas to life and gain new insights.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs an Innovative Visionary, you enjoy sharing your ideas and inspiring others. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your ideas.\n\n**Communicating with Friends:** Your friends appreciate your creativity and vision. Make sure to listen to their ideas and build on them together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your imagination and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints.\n\n**Effective Communication:** When communicating your complex ideas, use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.\n",
      "closing": "Remember, these are just suggestions based on your Innovative Visionary personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "\nYou thrive in environments where you can be creative and explore new ideas. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, and innovative startups.\n",
      "inspirationalQuotes": [
        {
          "quote": "Innovation distinguishes between a leader and a follower.",
          "avatarURL": "",
          "name": "Steve Jobs",
          "description": "The co-founder of Apple Inc., known for his visionary thinking and innovative contributions to technology and design."
        },
        {
          "quote": "If there's a book that you want to read, but it hasn't been written yet, then you must write it.",
          "avatarURL": "",
          "name": "Toni Morrison",
          "description": "A celebrated author and Nobel Prize winner, known for her imaginative storytelling and profound insights into the human experience."
        },
        {
          "quote": "You can’t use up creativity. The more you use, the more you have.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "A renowned author and poet who emphasized the importance of creativity and perseverance in overcoming challenges."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love visual creativity.",
          "title": "Associate’s Degree in Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in promoting products and services online.",
          "title": "Certificate in Digital Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to create and innovate products.",
          "title": "Diploma in Product Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring filmmakers and directors.",
          "title": "Training Program in Film Production"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who enjoy expressing themselves through writing.",
          "title": "Certificate in Creative Writing"
        }
      ],
      "whatItMeans": "Being an Innovative Visionary means you are characterized by high levels of **Openness** and an **Artistic** approach. **Openness** refers to being imaginative, curious, and open to new experiences. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and innovation.",
      "recommendedCareersOpening": "As an Innovative Visionary, your creativity and visionary thinking make you perfect for roles that involve innovation, design, and artistic expression.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5004"
          ],
          "description": "Learn the principles of visual communication and design.",
          "title": "Graphic Design"
        },
        {
          "link": "",
          "description": "Study how to promote products and services effectively.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "description": "Focus on creating and developing concepts for manufactured products.",
          "cipCodes": [
            "5006"
          ],
          "title": "Industrial Design"
        },
        {
          "link": "",
          "cipCodes": [
            "5005"
          ],
          "description": "Explore the art and industry of filmmaking.",
          "title": "Film Studies"
        },
        {
          "link": "",
          "cipCodes": [
            "2313"
          ],
          "description": "Develop your skills in writing fiction, poetry, and creative non-fiction.",
          "title": "Creative Writing"
        }
      ],
      "superpowers": " - Creativity: You excel at generating new and original ideas. - Imagination: Your rich inner world allows you to see possibilities that others might miss. - Visionary Thinking: You have the ability to envision a future that is different and better. - Inspiration: You motivate and inspire others with your passion and innovative ideas. "
    },
    {
      "id": "Conventional_Agreeableness",
      "relationshipTips": "In friendships and teamwork, you bring a reliable and organized energy. Your friends and colleagues appreciate your dependability and attention to detail. Be patient and understanding when others may not be as organized as you.",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Reliable Executor, you excel at dependably carrying out conventional roles with accuracy and consistency. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Reliable Executor",
      "areasToImprove": "* Cultivate Flexibility: Be open to adapting your plans when unexpected changes occur.\n* Encourage Creativity: Allow yourself to think outside the box and explore creative solutions.\n* Practice Delegation: Trust others with responsibilities to build a stronger team.",
      "personalGoals": [
        "* Cultivate Flexibility: Practice being open to different approaches and solutions.",
        "* Encourage Creativity: Engage in activities that foster creative thinking.",
        "* Practice Delegation: Develop your ability to delegate tasks to others.",
        "* Enhance Communication Skills: Work on expressing your ideas clearly and listening to others.",
        "* Develop Emotional Intelligence: Improve your understanding of your own emotions and those of others."
      ],
      "closing": "Remember, these are just suggestions based on your Reliable Executor personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "* Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "* Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention.",
        "* Organize Study Materials: Use your organizational skills to create effective study guides, summaries, and charts.",
        "* Manage Group Projects: Take the lead in organizing tasks, setting deadlines, and keeping the group on track."
      ],
      "workStyle": "You thrive in environments where you can systematically manage tasks and maintain order. You prefer structured settings that allow you to focus on your work and employ a methodical approach to tasks. Routine tasks suit you well, as you take satisfaction in completing detailed and organized work. For example, managing an office's filing system or overseeing data entry for a project would be ideal scenarios for you.",
      "inspirationalQuotes": [
        {
          "quote": "All great achievements require time.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "The renowned poet and author emphasizes patience and sustained effort, which are essential qualities for a Reliable Executor to achieve long-term success."
        },
        {
          "quote": "Genius is one percent inspiration and ninety-nine percent perspiration.",
          "avatarURL": "",
          "name": "Thomas Edison",
          "description": "Inventor Thomas Edison emphasizes the importance of hard work and consistent effort, resonating with the Reliable Executor’s dedication to thoroughness and reliability."
        },
        {
          "quote": "It takes as much energy to wish as it does to plan.",
          "avatarURL": "",
          "name": "Eleanor Roosevelt",
          "description": "Former First Lady Eleanor Roosevelt highlights the importance of proactive planning, a key trait of the Reliable Executor who values structured and organized efforts."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love planning and organizing.",
          "title": "Associate’s Degree in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and coordinating projects.",
          "title": "Certificate in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy organizing and managing office tasks.",
          "title": "Diploma in Office Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for individuals who love working with data and information systems.",
          "title": "Training Program in Data Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to manage patient data and medical records in healthcare settings.",
          "title": "Certification in Health Information Management"
        }
      ],
      "whatItMeans": "Being a Reliable Executor means you are characterized by high levels of Conscientiousness and a Conventional approach. Conscientiousness refers to being organized, reliable, and thorough. Conventional individuals enjoy structure, order, and working with data and details.",
      "recommendedCareersOpening": "As a Reliable Executor, your ability to manage information and maintain order makes you perfect for roles that require precision and organization.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn the skills needed to manage and organize businesses.",
          "cipCodes": [
            "5202"
          ],
          "title": "Business Administration"
        },
        {
          "link": "",
          "cipCodes": [
            "5203"
          ],
          "description": "Develop skills in managing financial records and ensuring accuracy.",
          "title": "Accounting"
        },
        {
          "link": "",
          "cipCodes": [
            "1104",
            "1105"
          ],
          "description": "Study how to manage and organize data and technology.",
          "title": "Information Systems"
        },
        {
          "link": "",
          "description": "Focus on the organization and management of library resources.",
          "cipCodes": [
            "2501"
          ],
          "title": "Library Science"
        },
        {
          "link": "",
          "description": "Study how to manage patient data and medical records in healthcare settings.",
          "cipCodes": [
            "5107"
          ],
          "title": "Health Information Management"
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "43-6011.00",
          "link": "",
          "description": "Provide administrative support, ensuring office operations run smoothly.",
          "title": "Administrative Assistant"
        },
        {
          "onetCode": "43-9021.00",
          "link": "",
          "description": "Input and manage data accurately and efficiently.",
          "title": "Data Entry Clerk"
        },
        {
          "onetCode": "43-3031.00",
          "link": "",
          "description": "Maintain financial records and ensure accuracy in financial reporting.",
          "title": "Bookkeeper"
        },
        {
          "onetCode": "29-2072.00",
          "link": "",
          "description": "Manage patient data and medical records in healthcare settings.",
          "title": "Medical Records Specialists"
        },
        {
          "onetCode": "11-3012.00",
          "link": "",
          "description": "Oversee office operations and procedures to ensure efficiency and effectiveness.",
          "title": "Office Manager"
        }
      ],
      "howYouCommunicate": "As a Reliable Executor, you communicate in a clear and structured manner. You prefer sharing information that is well-organized and logically presented. Remember to listen actively to others and consider their viewpoints to enhance your understanding. * **Communicating with Friends**: You bring a dependable and organized energy to your friendships. Your friends appreciate your reliability and your help in planning events or activities. Be open to spontaneous plans and different approaches. * **Communicating in Romantic Relationships**: You value stability and clear communication in relationships. Show your care by being dependable and thoughtful. Ensure you also cultivate emotional intimacy and be open to new experiences with your partner. * **Communicating with Family**: Your family relies on you to keep things in order, from organizing family events to managing schedules. Balance your helpfulness with taking time to relax and enjoy family moments.",
      "superpowers": " - Dependability: You can always be relied upon to follow through on tasks and commitments. - Attention to Detail: You excel at noticing and managing the small details that others might miss. - Consistency: You perform tasks with a high degree of accuracy and reliability. - Organizational Skills: You maintain orderly systems and procedures, ensuring everything is in its place. "
    },
    {
      "id": "Conventional_Conscientiousness",
      "relationshipTips": "In friendships and teamwork, you bring a reliable and organized energy. Your friends and colleagues appreciate your dependability and attention to detail. Be patient and understanding when others may not be as organized as you.",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Precise Administrator, you excel at ensuring accuracy and detail in administrative work. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Precise Administrator",
      "areasToImprove": "* Cultivate Flexibility: Be open to adapting your plans when unexpected changes occur.\n* Encourage Creativity: Allow yourself to think outside the box and explore creative solutions.\n* Practice Delegation: Trust others with responsibilities to build a stronger team.",
      "personalGoals": [
        "* Cultivate Flexibility: Practice being open to different approaches and solutions.",
        "* Encourage Creativity: Engage in activities that foster creative thinking.",
        "* Practice Delegation: Develop your ability to delegate tasks to others.",
        "* Enhance Communication Skills: Work on expressing your ideas clearly and listening to others.",
        "* Develop Emotional Intelligence: Improve your understanding of your own emotions and those of others."
      ],
      "closing": "Remember, these are just suggestions based on your Precise Administrator personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "* Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "* Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention.",
        "* Organize Study Materials: Use your organizational skills to create effective study guides, summaries, and charts.",
        "* Manage Group Projects: Take the lead in organizing tasks, setting deadlines, and keeping the group on track."
      ],
      "workStyle": "You thrive in environments where you can systematically manage tasks and maintain order. You prefer structured settings that allow you to focus on your work and employ a methodical approach to tasks. Routine tasks suit you well, as you take satisfaction in completing detailed and organized work. For example, managing an office's filing system or overseeing data entry for a project would be ideal scenarios for you.",
      "inspirationalQuotes": [
        {
          "quote": "One of the criticisms I've faced over the years is that I'm not aggressive enough or assertive enough, or maybe somehow, because I'm empathetic, it means I'm weak. I totally rebel against that. I refuse to believe that you cannot be both compassionate and strong.",
          "avatarURL": "",
          "name": "Jacinda Ardern",
          "description": "The New Zealand Prime Minister demonstrates the importance of balancing precision with empathy and compassion."
        },
        {
          "quote": "We will always have STEM with us. Some things will drop out of the public eye and will go away, but there will always be science, engineering, and technology. And there will always, always be mathematics.",
          "avatarURL": "",
          "name": "Katherine Johnson",
          "description": "Katherine Johnson’s dedication to accuracy and her critical contributions to spaceflight calculations highlight the value of precision and reliability."
        },
        {
          "quote": "Nothing in life is to be feared; it is only to be understood. Now is the time to understand more so that we may fear less.",
          "avatarURL": "",
          "name": "Marie Curie",
          "description": "Marie Curie’s dedication to scientific precision underscores the importance of methodical work and thorough understanding in achieving great outcomes."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love planning and organizing.",
          "title": "Associate’s Degree in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and coordinating projects.",
          "title": "Certificate in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy organizing and managing office tasks.",
          "title": "Diploma in Office Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for individuals who love working with data and information systems.",
          "title": "Training Program in Data Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in ensuring product standards.",
          "title": "Certificate in Quality Control"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to manage patient data and medical records in healthcare settings.",
          "title": "Certification in Health Information Management"
        }
      ],
      "whatItMeans": "Being a Precise Administrator means you are characterized by high levels of Conscientiousness and a Conventional approach. Conscientiousness refers to being organized, reliable, and thorough. Conventional individuals enjoy structure, order, and working with data and details.",
      "recommendedCareersOpening": "As a Precise Administrator, your ability to manage information and maintain order makes you perfect for roles that require precision and organization.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the skills needed to manage and organize businesses.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "cipCodes": [
            "5203"
          ],
          "description": "Develop skills in managing financial records and ensuring accuracy.",
          "title": "Accounting"
        },
        {
          "link": "",
          "cipCodes": [
            "1104",
            "1105"
          ],
          "description": "Study how to manage and organize data and technology.",
          "title": "Information Systems"
        },
        {
          "link": "",
          "cipCodes": [
            "2501"
          ],
          "description": "Focus on the organization and management of library resources.",
          "title": "Library Science"
        },
        {
          "link": "",
          "cipCodes": [
            "5202",
            "5203",
            "5204"
          ],
          "description": "Learn how to manage the flow of goods and services.",
          "title": "Logistics and Supply Chain Management"
        },
        {
          "link": "",
          "cipCodes": [
            "5107"
          ],
          "description": "Study how to manage patient data and medical records in healthcare settings.",
          "title": "Health Information Management"
        }
      ],
      "howYouCommunicate": "As a Precise Administrator, you communicate in a clear and structured manner. You prefer sharing information that is well-organized and logically presented. Remember to listen actively to others and consider their viewpoints to enhance your understanding. * **Communicating with Friends**: You bring a reliable and organized energy to your friendships. Your friends appreciate your dependability and your help in planning events or activities. Be open to spontaneous plans and different approaches.* **Communicating in Romantic Relationships**: You value stability and clear communication in relationships. Show your care by being dependable and thoughtful. Ensure you also cultivate emotional intimacy and be open to new experiences with your partner.* **Communicating with Family**: Your family relies on you to keep things in order, from organizing family events to managing schedules. Balance your helpfulness with taking time to relax and enjoy family moments.",
      "superpowers": " - Master of Precision: You ensure tasks are completed accurately and with great attention to detail. - Organizational Guru: You excel at maintaining orderly systems and procedures. - Dependable Executor: You can be relied upon to follow through on tasks and commitments. - Systematic Thinker: You approach tasks methodically, ensuring no detail is overlooked. ",
      "recommendedCareers": [
        {
          "title": "Data Analyst",
          "description": "Interpret complex data sets to help businesses make informed decisions and improve efficiency.",
          "link": "",
          "onetCode": "15-2051.00"
        },
        {
          "description": "Ensure products meet quality standards by conducting tests and inspections.",
          "onetCode": "19-4099.01",
          "title": "Quality Control Analyst",
          "link": ""
        },
        {
          "description": "Use advanced mathematical and analytical methods to help organizations solve problems and make better decisions.",
          "title": "Operations Research Analyst",
          "link": "",
          "onetCode": "15-2031.00"
        },
        {
          "title": "Computer Systems Analyst",
          "link": "",
          "onetCode": "15-1211.00",
          "description": "Analyze and design information systems to help organizations operate more efficiently."
        },
        {
          "title": "Administrative Services Manager",
          "link": "",
          "onetCode": "11-3012.00",
          "description": "Plan, coordinate, and direct supportive services of an organization."
        },
        {
          "title": "Health Information Manager",
          "onetCode": "11-9111.00",
          "description": "Manage patient data and medical records in healthcare settings.",
          "link": ""
        }
      ]
    },
    {
      "id": "Conventional_Emotional-Stability",
      "relationshipTips": "In friendships and teamwork, you bring a reliable and organized energy. Your friends and colleagues appreciate your dependability and attention to detail. Be patient and understanding when others may not be as organized as you.",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Steady Organizer, you excel at planning and executing routine tasks with stability and precision. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Steady Organizer",
      "areasToImprove": "* Cultivate Flexibility: Be open to adapting your plans when unexpected changes occur.\n* Encourage Creativity: Allow yourself to think outside the box and explore creative solutions.\n* Practice Delegation: Trust others with responsibilities to build a stronger team.",
      "personalGoals": [
        "* Cultivate Flexibility: Practice being open to different approaches and solutions.",
        "* Encourage Creativity: Engage in activities that foster creative thinking.",
        "* Practice Delegation: Develop your ability to delegate tasks to others.",
        "* Enhance Communication Skills: Work on expressing your ideas clearly and listening to others.",
        "* Develop Emotional Intelligence: Improve your understanding of your own emotions and those of others."
      ],
      "closing": "Remember, these are just suggestions based on your Steady Organizer personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "* Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "* Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention.",
        "* Organize Study Materials: Use your organizational skills to create effective study guides, summaries, and charts.",
        "* Manage Group Projects: Take the lead in organizing tasks, setting deadlines, and keeping the group on track."
      ],
      "workStyle": "You thrive in environments where you can systematically manage tasks and maintain order. You prefer structured settings that allow you to focus on your work and employ a methodical approach to tasks. Routine tasks suit you well, as you take satisfaction in completing detailed and organized work. For example, managing an office's filing system or overseeing data entry for a project would be ideal scenarios for you.",
      "inspirationalQuotes": [
        {
          "quote": "Genius is one percent inspiration and ninety-nine percent perspiration.",
          "avatarURL": "",
          "name": "Thomas Edison",
          "description": "Inventor Thomas Edison emphasizes the importance of hard work and consistent effort, resonating with the Steady Organizer’s dedication to thoroughness and reliability."
        },
        {
          "quote": "Success isn’t about how much money you make. It’s about the difference you make in people’s lives.",
          "avatarURL": "",
          "name": "Michelle Obama",
          "description": "The former First Lady of the United States emphasizes the importance of impactful work and meaningful contributions, resonating with the Steady Organizer's drive to make a significant difference through organized and efficient efforts."
        },
        {
          "quote": "Knowing what must be done does away with fear.",
          "avatarURL": "",
          "name": "Rosa Parks",
          "description": "Civil rights activist Rosa Parks highlights the power of clarity and determination, key traits of a Steady Organizer who values structure and decisive action."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love planning and organizing.",
          "title": "Associate’s Degree in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and coordinating projects.",
          "title": "Certificate in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy organizing and managing office tasks.",
          "title": "Diploma in Office Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for individuals who love working with data and information systems.",
          "title": "Training Program in Data Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to manage patient data and medical records in healthcare settings.",
          "title": "Certification in Health Information Management"
        }
      ],
      "whatItMeans": "Being a Steady Organizer means you are characterized by high levels of Conscientiousness and a Conventional approach. Conscientiousness refers to being organized, reliable, and thorough. Conventional individuals enjoy structure, order, and working with data and details.",
      "recommendedCareersOpening": "As a Steady Organizer, your ability to manage information and maintain order makes you perfect for roles that require precision and organization.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn the skills needed to manage and organize businesses.",
          "cipCodes": [
            "5202"
          ],
          "title": "Business Administration"
        },
        {
          "link": "",
          "description": "Develop skills in managing financial records and ensuring accuracy.",
          "cipCodes": [
            "5203"
          ],
          "title": "Accounting"
        },
        {
          "link": "",
          "description": "Study how to manage and organize data and technology.",
          "cipCodes": [
            "1104",
            "1105"
          ],
          "title": "Information Systems"
        },
        {
          "link": "",
          "cipCodes": [
            "2501"
          ],
          "description": "Focus on the organization and management of library resources.",
          "title": "Library Science"
        },
        {
          "link": "",
          "cipCodes": [
            "5107"
          ],
          "description": "Study how to manage patient data and medical records in healthcare settings.",
          "title": "Health Information Management"
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "43-6011.00",
          "link": "",
          "description": "Provide administrative support, ensuring office operations run smoothly.",
          "title": "Administrative Assistant"
        },
        {
          "onetCode": "43-9021.00",
          "link": "",
          "description": "Input and manage data accurately and efficiently.",
          "title": "Data Entry Clerk"
        },
        {
          "onetCode": "43-3031.00",
          "link": "",
          "description": "Maintain financial records and ensure accuracy in financial reporting.",
          "title": "Bookkeeper"
        },
        {
          "onetCode": "29-2072.00",
          "link": "",
          "description": "Manage patient data and medical records in healthcare settings.",
          "title": "Medical Records Specialists"
        },
        {
          "onetCode": "11-3012.00",
          "link": "",
          "description": "Oversee office operations and procedures to ensure efficiency and effectiveness.",
          "title": "Office Manager"
        }
      ],
      "howYouCommunicate": "As an Efficient Coordinator, you communicate in a clear and structured manner. You prefer sharing information that is well-organized and logically presented. Remember to listen actively to others and consider their viewpoints to enhance your understanding. * **Communicating with Friends**: You bring a dependable and organized energy to your friendships. Your friends appreciate your reliability and your help in planning events or activities. Be open to spontaneous plans and different approaches.* **Communicating in Romantic Relationships**: You value stability and clear communication in relationships. Show your care by being dependable and thoughtful. Ensure you also cultivate emotional intimacy and be open to new experiences with your partner.* **Communicating with Family**: Your family relies on you to keep things in order, from organizing family events to managing schedules. Balance your helpfulness with taking time to relax and enjoy family moments.",
      "superpowers": " - Dependability: You can always be relied upon to follow through on tasks and commitments. - Attention to Detail: You excel at noticing and managing the small details that others might miss. - Consistency: You perform tasks with a high degree of accuracy and reliability. - Organizational Skills: You maintain orderly systems and procedures, ensuring everything is in its place. "
    },
    {
      "id": "Conventional_Extraversion",
      "relationshipTips": "\nIn friendships and teamwork, you bring a reliable and organized energy. Your friends and colleagues appreciate your dependability and attention to detail. Be patient and understanding when others may not be as organized as you.\n",
      "recommendedCareers": [
        {
          "onetCode": "13-1082.00",
          "link": "",
          "description": "Assist in the planning, execution, and completion of projects.",
          "title": "Project Coordinator"
        },
        {
          "onetCode": "11-3012.00",
          "link": "",
          "description": "Oversee office operations and procedures to ensure efficiency and effectiveness.",
          "title": "Office Manager"
        },
        {
          "onetCode": "13-1121.00",
          "link": "",
          "description": "Coordinate all aspects of professional meetings and events.",
          "title": "Event Planner"
        },
        {
          "onetCode": "43-6011.00",
          "link": "",
          "description": "Provide high-level administrative support to executives.",
          "title": "Executive Assistant"
        },
        {
          "onetCode": "11-9111.00",
          "link": "",
          "description": "Manage patient data and medical records in healthcare settings.",
          "title": "Health Information Manager"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Efficient Coordinator, you excel at smoothly coordinating tasks and ensuring everything runs efficiently. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Efficient Coordinator",
      "areasToImprove": "\n- Cultivate Flexibility: Be open to adapting your plans when unexpected changes occur.\n- Encourage Creativity: Allow yourself to think outside the box and explore creative solutions.\n- Practice Delegation: Trust others with responsibilities to build a stronger team.\n",
      "personalGoals": [
        "Cultivate Flexibility: Practice being open to different approaches and solutions.",
        "Encourage Creativity: Engage in activities that foster creative thinking.",
        "Practice Delegation: Develop your ability to delegate tasks to others.",
        "Enhance Communication Skills: Work on expressing your ideas clearly and listening to others.",
        "Develop Emotional Intelligence: Improve your understanding of your own emotions and those of others."
      ],
      "closing": "Remember, these are just suggestions based on your Efficient Coordinator personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention.",
        "Organize Study Materials: Use your organizational skills to create effective study guides, summaries, and charts.",
        "Manage Group Projects: Take the lead in organizing tasks, setting deadlines, and keeping the group on track."
      ],
      "workStyle": "\nYou thrive in environments where you can systematically manage tasks and maintain order. You prefer structured settings that allow you to focus on your work and employ a methodical approach to tasks. Routine tasks suit you well, as you take satisfaction in completing detailed and organized work. For example, coordinating schedules and resources for a project or managing the logistics of an event would be ideal scenarios for you.\n",
      "inspirationalQuotes": [
        {
          "quote": "By failing to prepare, you are preparing to fail.",
          "avatarURL": "",
          "name": "Benjamin Franklin",
          "description": "The American polymath stresses the necessity of preparation and planning, crucial for an Efficient Coordinator who values structure and order."
        },
        {
          "quote": "The way to get started is to quit talking and begin doing.",
          "avatarURL": "",
          "name": "Walt Disney",
          "description": "The visionary animator and entrepreneur emphasizes the importance of action and execution, qualities that are central to the Efficient Coordinator's role in getting things done."
        },
        {
          "quote": "I don’t like to lose – at anything – yet I’ve grown most not from victories, but setbacks.",
          "avatarURL": "",
          "name": "Serena Williams",
          "description": "The tennis champion's focus on learning from setbacks and striving for excellence resonates with the Efficient Coordinator’s pursuit of continuous improvement and efficiency."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love planning and organizing.",
          "title": "Associate’s Degree in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and coordinating projects.",
          "title": "Certificate in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy organizing and managing office tasks.",
          "title": "Diploma in Office Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for individuals who love working with data and information systems.",
          "title": "Training Program in Data Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to manage patient data and medical records in healthcare settings.",
          "title": "Certification in Health Information Management"
        }
      ],
      "whatItMeans": "Being an Efficient Coordinator means you are characterized by high levels of Conscientiousness and a Conventional approach. Conscientiousness refers to being organized, reliable, and thorough. Conventional individuals enjoy structure, order, and working with data and details.",
      "recommendedCareersOpening": "As an Efficient Coordinator, your ability to manage information and maintain order makes you perfect for roles that require precision and organization.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the skills needed to manage and organize businesses.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "cipCodes": [
            "5203"
          ],
          "description": "Develop skills in managing financial records and ensuring accuracy.",
          "title": "Accounting"
        },
        {
          "link": "",
          "description": "Study how to manage and organize data and technology.",
          "cipCodes": [
            "1101",
            "1102",
            "1103",
            "1104",
            "1105"
          ],
          "title": "Information Systems"
        },
        {
          "link": "",
          "description": "Focus on the organization and management of library resources.",
          "cipCodes": [
            "2501"
          ],
          "title": "Library Science"
        },
        {
          "link": "",
          "description": "Study how to manage patient data and medical records in healthcare settings.",
          "cipCodes": [
            "5107"
          ],
          "title": "Health Information Management"
        }
      ],
      "howYouCommunicate": "As an Efficient Coordinator, you communicate in a clear and structured manner. You prefer sharing information that is well-organized and logically presented. Remember to listen actively to others and consider their viewpoints to enhance your understanding.  * **Communicating with Friends**: You bring a reliable and organized energy to your friendships. Your friends appreciate your dependability and your help in planning events or activities. Be open to spontaneous plans and different approaches.* **Communicating in Romantic Relationships**: You value stability and clear communication in relationships. Show your care by being dependable and thoughtful. Ensure you also cultivate emotional intimacy and be open to new experiences with your partner.* **Communicating with Family**: Your family relies on you to keep things in order, from organizing family events to managing schedules. Balance your helpfulness with taking time to relax and enjoy family moments.",
      "superpowers": " - Master of Efficiency: You ensure tasks are completed quickly and effectively, making sure nothing falls through the cracks. - Organizational Pro: You excel at maintaining orderly systems and procedures. - Dependable Executor: You can be relied upon to follow through on tasks and commitments. - Systematic Thinker: You approach tasks methodically, ensuring no detail is overlooked. "
    },
    {
      "id": "Conventional_Openness",
      "relationshipTips": "In friendships and teamwork, you bring a reliable and organized energy. Your friends and colleagues appreciate your dependability and attention to detail. Be patient and understanding when others may not be as organized as you.",
      "recommendedCareers": [
        {
          "onetCode": "15-2041.00",
          "link": "",
          "description": "Interpret complex data sets to help businesses make informed decisions and improve efficiency.",
          "title": "Data Analyst"
        },
        {
          "onetCode": "19-4099.01",
          "link": "",
          "description": "Ensure products meet quality standards by conducting tests and inspections.",
          "title": "Quality Control Analyst"
        },
        {
          "onetCode": "15-2031.00",
          "link": "",
          "description": "Use advanced mathematical and analytical methods to help organizations solve problems and make better decisions.",
          "title": "Operations Research Analyst"
        },
        {
          "onetCode": "15-1211.00",
          "link": "",
          "description": "Analyze and design information systems to help organizations operate more efficiently.",
          "title": "Computer Systems Analyst"
        },
        {
          "onetCode": "11-3012.00",
          "link": "",
          "description": "Plan, coordinate, and direct supportive services of an organization.",
          "title": "Administrative Services Manager"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Methodical Organizer, you excel at systematically managing information and keeping everything in order. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Methodical Organizer",
      "areasToImprove": "* Cultivate Flexibility: Be open to adapting your plans when unexpected changes occur.\n* Encourage Creativity: Allow yourself to think outside the box and explore creative solutions.\n* Practice Delegation: Trust others with responsibilities to build a stronger team.",
      "personalGoals": [
        "* Cultivate Flexibility: Practice being open to different approaches and solutions.",
        "* Encourage Creativity: Engage in activities that foster creative thinking.",
        "* Practice Delegation: Develop your ability to delegate tasks to others.",
        "* Enhance Communication Skills: Work on expressing your ideas clearly and listening to others.",
        "* Develop Emotional Intelligence: Improve your understanding of your own emotions and those of others."
      ],
      "closing": "Remember, these are just suggestions based on your Methodical Organizer personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "* Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "* Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention.",
        "* Organize Study Materials: Use your organizational skills to create effective study guides, summaries, and charts.",
        "* Manage Group Projects: Take the lead in organizing tasks, setting deadlines, and keeping the group on track."
      ],
      "workStyle": "You thrive in environments where you can systematically manage tasks and maintain order. You prefer structured settings that allow you to focus on your work and employ a methodical approach to tasks. Routine tasks suit you well, as you take satisfaction in completing detailed and organized work. For example, organizing an office's filing system or managing data for a research project would be ideal scenarios for you.",
      "inspirationalQuotes": [
        {
          "quote": "Knowing what must be done does away with fear.",
          "avatarURL": "",
          "name": "Rosa Parks",
          "description": "Rosa Parks emphasizes the power of clarity and organization in overcoming challenges and taking decisive action."
        },
        {
          "quote": "All great achievements require time.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "Maya Angelou highlights the importance of patience and sustained effort, which are key qualities of a methodical organizer."
        },
        {
          "quote": "The most effective way to do it, is to do it.",
          "avatarURL": "",
          "name": "Amelia Earhart",
          "description": "Amelia Earhart’s straightforward approach to action emphasizes the importance of methodical planning and execution in achieving goals."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love planning and organizing.",
          "title": "Associate’s Degree in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and coordinating projects.",
          "title": "Certificate in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy organizing and managing office tasks.",
          "title": "Diploma in Office Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for individuals who love working with data and information systems.",
          "title": "Training Program in Data Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in ensuring product standards.",
          "title": "Certificate in Quality Control"
        }
      ],
      "whatItMeans": "Being a Methodical Organizer means you are characterized by high levels of Conscientiousness and a Conventional approach. Conscientiousness refers to being organized, reliable, and thorough. Conventional individuals enjoy structure, order, and working with data and details.",
      "recommendedCareersOpening": "As a Methodical Organizer, your ability to manage information and maintain order makes you perfect for roles that require precision and organization.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the skills needed to manage and organize businesses.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "cipCodes": [
            "5203"
          ],
          "description": "Develop skills in managing financial records and ensuring accuracy.",
          "title": "Accounting"
        },
        {
          "link": "",
          "description": "Study how to manage and organize data and technology.",
          "cipCodes": [
            "1104",
            "1105"
          ],
          "title": "Information Systems"
        },
        {
          "link": "",
          "cipCodes": [
            "2501"
          ],
          "description": "Focus on the organization and management of library resources.",
          "title": "Library Science"
        },
        {
          "link": "",
          "description": "Learn how to manage the flow of goods and services.",
          "cipCodes": [
            "5213"
          ],
          "title": "Logistics and Supply Chain Management"
        }
      ],
      "howYouCommunicate": "As a Methodical Organizer, you communicate in a clear and structured manner. You prefer to share information that is well-researched and logically organized. Remember to listen actively to others and consider their viewpoints to enhance your understanding.  * **Communicating with Friends**: You bring a reliable and organized energy to your friendships. Your friends appreciate your dependability and the way you can help them organize plans or events. Make sure to also be open to spontaneous activities and discussions.* **Communicating in Romantic Relationships**: You value stability and clear communication in relationships. You show your care by being dependable and thoughtful. Remember to be flexible and open to new experiences with your partner.* **Communicating with Family:** Your family relies on you for keeping things in order, from organizing family events to managing schedules. Balance your helpfulness with taking time to relax and enjoy family moments.",
      "superpowers": " - Master of Order: You excel at creating and maintaining organized systems. - Detail Detective: You notice and manage the small details that others might miss. - Systematic Planner: You have a knack for developing and following detailed plans. - Reliable Executor: You can be counted on to complete tasks accurately and on time. "
    },
    {
      "id": "Enterprising_Agreeableness",
      "relationshipTips": "In friendships and teamwork, you bring a confident and persuasive energy. You enjoy motivating others and driving projects forward. Be patient and understanding when others need time to adapt to your ideas.",
      "recommendedCareers": [
        {
          "onetCode": "11-2021.00",
          "link": "",
          "description": "Develop and implement marketing strategies to promote products and services.",
          "title": "Marketing Manager"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Create and maintain a favorable public image for organizations.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "11-2022.00",
          "link": "",
          "description": "Direct an organization’s sales team, set goals, and analyze data to improve sales strategies.",
          "title": "Sales Manager"
        },
        {
          "onetCode": "13-1111.00",
          "link": "",
          "description": "Help organizations solve issues, create value, and improve business performance.",
          "title": "Management Consultant"
        },
        {
          "onetCode": "13-1151.00",
          "link": "",
          "description": "Develop and implement training programs to improve employee skills and performance.",
          "title": "Corporate Trainer"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Persuasive Strategist, you excel at advocating for strategic plans and convincing others to see the value in your ideas. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Persuasive Strategist",
      "areasToImprove": "* Cultivate Patience: Practice being patient and allowing others to share their ideas and thoughts.\n* Embrace Adaptability: Be open to adapting your strategies when new information or feedback is presented.\n* Enhance Listening: Improve your active listening skills to understand different perspectives and foster collaboration.",
      "personalGoals": [
        "* Cultivate Patience: Practice taking a step back to think through problems before acting.",
        "* Enhance Communication: Work on expressing your ideas clearly and listening to others.",
        "* Focus on Planning: Develop your planning skills to manage tasks more effectively.",
        "* Learn Digital Skills: Explore how technology can enhance your strategic skills and open new career opportunities.",
        "* Develop Soft Skills: Improve teamwork, leadership, and interpersonal skills to complement your strategic abilities."
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends appreciate your creativity and charisma. Make sure to listen to their ideas and build on them together.\n* **Communicating in Romantic Relationships**: In romantic relationships, your imagination and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n* **Communicating with Family**: Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints.\n* **Effective Communication**: Use active listening, empathy, and clear articulation to ensure your ideas are understood and others feel heard.",
      "closing": "Remember, these are just suggestions based on your Persuasive Strategist personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Structured Study Plan: Break down your study sessions into manageable chunks and set clear goals.",
        "* Engage in Deep Learning: Go beyond surface learning and explore topics in depth to satisfy your curiosity.",
        "* Incorporate Problem-Solving Activities: Use puzzles and problem-solving exercises to keep your mind sharp and engaged."
      ],
      "workStyle": "You thrive in environments where you can lead, strategize, and implement your ideas. You enjoy challenges that require critical thinking and strategic planning. Routine tasks might bore you, so seek opportunities that allow you to use your leadership and strategic skills. For example, working on a high-stakes marketing campaign where you can plan strategies, persuade stakeholders, and lead a team to success would be an ideal scenario.",
      "inspirationalQuotes": [
        {
          "quote": "The time is always right to do what is right.",
          "avatarURL": "",
          "name": "Martin Luther King Jr.",
          "description": "Martin Luther King Jr.'s focus on moral integrity highlights the value of ethical strategic decisions."
        },
        {
          "quote": "One child, one teacher, one book, one pen can change the world.",
          "avatarURL": "",
          "name": "Malala Yousafzai",
          "description": "Malala Yousafzai's advocacy for education demonstrates the impact of strategic efforts on creating significant change."
        },
        {
          "quote": "Success isn’t about how much money you make. It’s about the difference you make in people’s lives.",
          "avatarURL": "",
          "name": "Michelle Obama",
          "description": "Michelle Obama's perspective on success aligns with the idea that strategic leadership should aim to make a positive impact."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to develop skills in promoting products and services.",
          "title": "Associate’s Degree in Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing public images and media relations.",
          "title": "Certificate in Public Relations"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to develop their management skills.",
          "title": "Diploma in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for individuals who want to gain hands-on experience in sales and customer relations.",
          "title": "Apprenticeship in Sales"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those looking to enhance their leadership and strategic planning skills.",
          "title": "Training Program in Leadership"
        }
      ],
      "whatItMeans": "Being a Persuasive Strategist means you are characterized by high levels of Extraversion and an Enterprising approach. Extraversion refers to being outgoing, energetic, and enjoying social interactions. Enterprising individuals thrive on leading, persuading, and managing projects or people.",
      "recommendedCareersOpening": "As a Persuasive Strategist, your ability to advocate for ideas and lead teams makes you a great fit for careers that involve strategic planning, leadership, and persuasive communication.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn the skills needed to manage and organize businesses.",
          "cipCodes": [
            "5202"
          ],
          "title": "Business Administration"
        },
        {
          "link": "",
          "description": "Understand the strategies behind promoting products and services.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "description": "Develop skills in public speaking, writing, and media.",
          "cipCodes": [
            "901",
            "907"
          ],
          "title": "Communications"
        },
        {
          "link": "",
          "description": "Explore the theory and practice of politics and government.",
          "cipCodes": [
            "4510"
          ],
          "title": "Political Science"
        },
        {
          "link": "",
          "description": "Study human behavior and learn how to influence and motivate others.",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "title": "Psychology"
        }
      ],
      "superpowers": " - Master of Influence: You can convincingly advocate for strategic plans and ideas, making others see the benefits of your vision. - Visionary Planner: You excel at planning and executing strategies to achieve your goals. - Leadership Dynamo: Your ability to lead and motivate others helps you drive projects and initiatives forward. - Confidence Booster: You project confidence in your ideas, which inspires trust and support from others. "
    },
    {
      "id": "Enterprising_Conscientiousness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a motivated and reliable energy. You enjoy inspiring others to reach their full potential. Be mindful of others' feelings and ensure that your ambition doesn't overshadow their needs.\n",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Disciplined Visionary, you possess a powerful blend of ambition, leadership, and efficiency. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Disciplined Visionary",
      "areasToImprove": "\n- Flexibility: Be open to adapting your plans when unexpected changes occur.\n- Empathy: Work on understanding and considering others' emotions and perspectives.\n- Delegation: Trust others with responsibilities to build a stronger team.\n",
      "personalGoals": [
        "Start a Leadership Journal: Reflect on your leadership experiences and identify areas for growth.",
        "Practice Active Listening: Focus on understanding others' perspectives before sharing your own.",
        "Set a Stretch Goal: Challenge yourself to achieve something beyond your comfort zone."
      ],
      "howYouCommunicate": "\nAs a Disciplined Visionary, your communication style is characterized by clarity, purpose, and persuasiveness. You excel at articulating complex ideas and inspiring others to action.\n\n**Communicating with Friends:** Your friends value your ambitious ideas and organized approach. Remember to also engage in casual conversations and show interest in their personal lives.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your drive and reliability are key strengths. Ensure you also express your emotions and understand your partner's needs beyond shared goals.\n\n**Communicating with Family:** Your family appreciates your leadership and future-oriented thinking. Share your visions with them, but also take time to understand and value their more immediate concerns.\n\n**Effective Communication:** Use your natural ability to plan and structure ideas when conveying complex concepts. Practice active listening to ensure you're addressing others' concerns and incorporating their input into your vision.\n",
      "closing": "Remember, these are just suggestions based on your Disciplined Visionary personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Rewards System: Motivate yourself by setting rewards for achieving study milestones.",
        "Teach Others: Reinforce your learning by explaining concepts to peers or study groups.",
        "Tackle the Hardest Tasks First: Capitalize on your ambition and tackle challenging tasks when your energy is high."
      ],
      "workStyle": "\nYou thrive in competitive environments that reward initiative and results. Goal-oriented tasks and leadership roles are your forte. You excel in fast-paced settings that allow you to showcase your skills and drive projects forward.\n",
      "inspirationalQuotes": [
        {
          "quote": "One of the criticisms I've faced over the years is that I'm not aggressive enough or assertive enough, or maybe somehow, because I'm empathetic, it means I'm weak. I totally rebel against that. I refuse to believe that you cannot be both compassionate and strong.",
          "avatarURL": "",
          "name": "Jacinda Ardern",
          "description": "The New Zealand Prime Minister demonstrates the importance of balancing ambition with empathy and compassion."
        },
        {
          "quote": "Wear your failure as a badge of honor!",
          "avatarURL": "",
          "name": "Sundar Pichai",
          "description": "The CEO of Google and Alphabet Inc., Sundar Pichai’s journey from humble beginnings to leading one of the world’s largest tech companies is a testament to the power of strategic planning and perseverance."
        },
        {
          "quote": "Embrace tough assignments. As they say, 'The best way to learn to swim is to swim in deep water!'",
          "avatarURL": "",
          "name": "Indra Nooyi",
          "description": "The former CEO of PepsiCo, Indra Nooyi is known for her strategic thinking and ability to drive organizational success, making her an inspiring figure for Disciplined Visionaries."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love planning and executing projects.",
          "title": "Associate’s Degree in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in improving organizational processes.",
          "title": "Certificate in Operations Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to develop their management skills.",
          "title": "Diploma in Business Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for detail-oriented individuals who enjoy organizing and managing tasks.",
          "title": "Apprenticeship in Office Administration"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in organizing and managing events.",
          "title": "Training Program in Event Planning"
        }
      ],
      "whatItMeans": "Being a Disciplined Visionary means you are characterized by high levels of Conscientiousness and an Enterprising approach. Conscientiousness refers to being organized, reliable, and goal-oriented. The Enterprising trait indicates a preference for leadership, persuasion, and strategic planning.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the skills needed to manage and organize businesses.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "description": "Develop skills in managing financial records and ensuring accuracy.",
          "cipCodes": [
            "5203"
          ],
          "title": "Accounting"
        },
        {
          "link": "",
          "description": "Focus on planning and executing projects efficiently.",
          "cipCodes": [
            "5202"
          ],
          "title": "Project Management"
        },
        {
          "link": "",
          "cipCodes": [
            "5202",
            "5206"
          ],
          "description": "Learn how to manage and improve organizational processes.",
          "title": "Operations Management"
        },
        {
          "link": "",
          "cipCodes": [
            "1101",
            "1102",
            "1103",
            "1104",
            "1105"
          ],
          "description": "Study how to manage and organize data and technology.",
          "title": "Information Systems"
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "11-9199.11",
          "link": "",
          "description": "Oversee projects from inception to completion, ensuring they are completed on time and within budget.",
          "title": "Project Manager"
        },
        {
          "onetCode": "11-1021.00",
          "link": "",
          "description": "Start and manage your own business, bringing your vision to life.",
          "title": "Entrepreneur"
        },
        {
          "onetCode": "11-2022.00",
          "link": "",
          "description": "Lead a sales team to achieve targets and drive business growth.",
          "title": "Sales Manager"
        },
        {
          "onetCode": "11-2032.00",
          "link": "",
          "description": "Shape an organization's public image and manage communications.",
          "title": "Public Relations Managers"
        },
        {
          "onetCode": "13-1111.00",
          "link": "",
          "description": "Advise businesses on strategies to improve performance and efficiency.",
          "title": "Management Consultant"
        },
        {
          "onetCode": "23-1011.00",
          "link": "",
          "description": "Represent clients in legal matters and advocate for their interests.",
          "title": "Lawyer"
        }
      ],
      "superpowers": " - Strategic Thinking: You excel at creating and implementing detailed long term plans. - Efficient Execution: Your ability to organize and manage resources effectively is outstanding. - Visionary Leadership: You can inspire others with your clear vision of the future. - Persistence: Your determination helps you overcome obstacles and achieve ambitious goals. "
    },
    {
      "id": "Enterprising_Emotional-Stability",
      "relationshipTips": "\nIn friendships and teamwork, you bring a positive and energetic energy. You enjoy helping others reach their potential and thrive on collaboration. Be patient and understanding when others need more time to adapt to changes.\n",
      "recommendedCareers": [
        {
          "onetCode": "11-2022.00",
          "link": "",
          "description": "Lead sales teams to meet targets, develop strategies, and foster client relationships.",
          "title": "Sales Manager"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "11-3121.00",
          "link": "",
          "description": "Oversee recruitment, training, and employee relations to ensure a motivated and productive workforce.",
          "title": "Human Resources Manager"
        },
        {
          "onetCode": "11-3131.00",
          "link": "",
          "description": "Design and implement programs to improve employee skills and performance.",
          "title": "Training and Development Manager"
        },
        {
          "onetCode": "13-1121.00",
          "link": "",
          "description": "Organize and coordinate events, ensuring they run smoothly and meet client expectations.",
          "title": "Event Planner"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Composed Strategist, you excel at inspiring and driving teams with stability and strategic insight. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Composed Strategist",
      "areasToImprove": "\n- Emotional Expression: Practice showing more enthusiasm to energize your team.\n- Risk-Taking: Be open to calculated risks that could lead to significant rewards.\n- Empathy: Work on connecting more deeply with others' emotions and perspectives.\n",
      "personalGoals": [
        "Complete a Leadership Project: Regularly take on projects that involve leading and motivating others.",
        "Practice Patience: Work on listening to others and understanding their perspectives.",
        "Set Learning Goals: Aim to learn something new each week, whether it’s a concept, skill, or hobby."
      ],
      "howYouCommunicate": "\nAs a Composed Strategist, your communication style is marked by clarity, calmness, and thoughtfulness. You excel at conveying complex ideas in a structured, easy-to-understand manner.\n\n**Communicating with Friends:** Your friends appreciate your levelheadedness and insightful advice. Remember to also engage in lighter, more spontaneous conversations to deepen connections.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your stability and reliability are key strengths. Ensure you also express your deeper emotions and show vulnerability to foster intimacy.\n\n**Communicating with Family:** Your family values your calm approach to challenges. Share your strategic insights with them, but also be open to their more immediate or emotional concerns.\n\n**Effective Communication:** Use your natural ability to remain calm to defuse tense situations. Practice active listening to fully understand others' perspectives before offering your strategic insights.\n",
      "closing": "Remember, these are just suggestions based on your Composed Strategist personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Set Clear Goals: Define what you want to achieve and create a plan to reach those goals.",
        "Engage in Group Study: Collaborate with others to enhance learning and stay motivated.",
        "Stay Organized: Keep track of your progress and adjust your plan as needed to stay on course."
      ],
      "workStyle": "\nYou thrive in environments where you can lead, inspire, and drive projects forward. Routine tasks might bore you, so seek out opportunities that involve strategic planning and team leadership. You prefer dynamic settings that allow you to showcase your leadership skills.\n",
      "inspirationalQuotes": [
        {
          "quote": "The greatest glory in living lies not in never falling, but in rising every time we fall.",
          "avatarURL": "",
          "name": "Nelson Mandela",
          "description": "A global symbol of peace and resilience, Mandela’s leadership and motivation continue to inspire millions."
        },
        {
          "quote": "The biggest adventure you can take is to live the life of your dreams.",
          "avatarURL": "",
          "name": "Oprah Winfrey",
          "description": "A media mogul and philanthropist known for her inspirational leadership and ability to motivate others to pursue their dreams."
        },
        {
          "quote": "Leadership is not about being in charge. It is about taking care of those in your charge.",
          "avatarURL": "",
          "name": "Simon Sinek",
          "description": "An author and motivational speaker known for his insights into leadership and team dynamics, encouraging leaders to inspire and support their teams."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love leading teams.",
          "title": "Associate’s Degree in Business Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in overseeing and guiding projects.",
          "title": "Certificate in Project Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to develop their leadership skills.",
          "title": "Diploma in Leadership and Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for detail-oriented individuals who enjoy helping others succeed.",
          "title": "Apprenticeship in Human Resources"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in improving team dynamics and performance.",
          "title": "Training Program in Organizational Development"
        }
      ],
      "whatItMeans": "Being a Composed Strategist means you are characterized by high levels of Emotional Stability and an Enterprising approach. Emotional Stability refers to being calm, resilient, and level-headed under pressure. The Enterprising trait indicates a preference for leadership, persuasion, and strategic planning.",
      "recommendedCareersOpening": "As a Composed Strategist, your energy and enthusiasm inspire those around you. You thrive in roles where you can lead, encourage, and drive teams towards achieving their goals. Your passion for motivating others makes you a natural fit for leadership and coaching positions.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the skills needed to lead and manage organizations.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "description": "Develop strategies to promote products and engage customers.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "cipCodes": [
            "901",
            "907"
          ],
          "description": "Enhance your skills in conveying ideas and motivating others.",
          "title": "Communications"
        },
        {
          "link": "",
          "description": "Understand the complexities of human behavior and motivation.",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "title": "Psychology"
        },
        {
          "link": "",
          "cipCodes": [
            "4510"
          ],
          "description": "Explore the workings of governments and leadership in public service.",
          "title": "Political Science"
        }
      ],
      "superpowers": " - Calm Leadership: You maintain composure in high pressure situations, inspiring confidence in others. - Strategic Thinking: Your ability to plan and execute long term strategies is exceptional. - Resilience: You bounce back from setbacks quickly and help others do the same. - Balanced Decision Making: You make sound judgments by considering both logic and emotion. "
    },
    {
      "id": "Enterprising_Extraversion",
      "superpowers": "\n- Leadership: You have a natural ability to inspire and guide others towards common goals.\n- Charisma: Your charm and energy attract and motivate people.\n- Persuasion: You excel at influencing others and convincing them to see your point of view.\n- Vision: You have a clear vision and can articulate it in a way that excites and engages others.\n",
      "relationshipTips": "\nIn friendships and teamwork, you bring a dynamic and motivating energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to adapt to changes. Use your leadership skills to strengthen relationships and solve interpersonal challenges.\n",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Charismatic Leader, you excel at inspiring and guiding others with your energy and charm. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Charismatic Leader",
      "areasToImprove": "\n- Listening: Practice active listening to understand others' perspectives better.\n- Patience: Be patient with others and allow them time to process and respond.\n- Detail Orientation: Focus on the finer details to ensure thoroughness in your projects.\n",
      "personalGoals": [
        "Practice Listening: Actively listen to understand others' perspectives better.",
        "Improve Patience: Be patient with others and allow them time to process and respond.",
        "Enhance Detail Orientation: Focus on the finer details to ensure thoroughness in your projects.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs a Charismatic Leader, you enjoy sharing your ideas and inspiring others. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your leadership.\n\n**Communicating with Friends:** Your friends appreciate your energy and innovative ideas. Make sure to listen to their thoughts and collaborate on projects together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your passion and enthusiasm are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your leadership and initiative. Share your visions with them and also take time to understand their viewpoints.\n\n**Effective Communication:** Use clear and persuasive language to convey your ideas, and practice active listening to ensure your audience feels heard and understood.\n",
      "closing": "Remember, these are just suggestions based on your Charismatic Leader personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Group Projects: Collaborate with others to develop your leadership and teamwork skills.",
        "Engage in Hands-On Activities: Use real-world examples to enhance your learning experience."
      ],
      "workStyle": "\nYou thrive in environments where you can lead, innovate, and take on new challenges. You prefer tasks that allow for strategic thinking and creativity. Routine tasks might bore you, so look for opportunities to take on dynamic projects and drive change.\n",
      "inspirationalQuotes": [
        {
          "quote": "The greatest glory in living lies not in never falling, but in rising every time we fall.",
          "avatarURL": "",
          "name": "Nelson Mandela",
          "description": "A global symbol of peace and resilience, Mandela’s leadership and motivation continue to inspire millions."
        },
        {
          "quote": "The biggest adventure you can take is to live the life of your dreams.",
          "avatarURL": "",
          "name": "Oprah Winfrey",
          "description": "A media mogul and philanthropist known for her inspirational leadership and ability to motivate others to pursue their dreams."
        },
        {
          "quote": "Business opportunities are like buses, there’s always another one coming.",
          "avatarURL": "",
          "name": "Richard Branson",
          "description": "A renowned entrepreneur and founder of the Virgin Group, emphasizing the importance of seizing opportunities and taking risks."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and leading teams.",
          "title": "Associate’s Degree in Business Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to develop and implement marketing strategies.",
          "title": "Certificate in Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to manage and promote public images.",
          "title": "Diploma in Public Relations"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring business owners and innovators.",
          "title": "Training Program in Entrepreneurship"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who want to enhance their leadership skills.",
          "title": "Certificate in Leadership"
        }
      ],
      "whatItMeans": "Being a Charismatic Leader means you are characterized by high levels of **Extraversion** and an **Enterprising** approach. **Extraversion** refers to being outgoing, energetic, and enjoying social interactions. **Enterprising** individuals enjoy leading, persuading, and managing projects or people.",
      "recommendedCareersOpening": "As a Charismatic Leader, your leadership and persuasive skills make you perfect for roles that involve managing projects, leading teams, and driving new ventures.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the fundamentals of managing and operating a business.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "description": "Develop strategies to promote products and services effectively.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "cipCodes": [
            "909"
          ],
          "description": "Study how to manage and promote the public image of organizations.",
          "title": "Public Relations"
        },
        {
          "link": "",
          "cipCodes": [
            "5207"
          ],
          "description": "Learn the skills needed to start and run your own business.",
          "title": "Entrepreneurship"
        },
        {
          "link": "",
          "description": "Explore various forms of communication and their impact on society.",
          "cipCodes": [
            "901",
            "907"
          ],
          "title": "Communication Studies"
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "11-2021.00",
          "link": "",
          "description": "Develop strategies to promote products and services, and lead marketing campaigns.",
          "title": "Marketing Manager"
        },
        {
          "onetCode": "11-2022.00",
          "link": "",
          "description": "Lead a sales team to achieve targets and drive business growth.",
          "title": "Sales Manager"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "11-3031.00",
          "link": "",
          "description": "Plan, direct, or coordinate accounting, investing, banking, insurance, securities, and other financial activities of a branch, office, or department of an establishment.",
          "title": "Financial Managers"
        },
        {
          "onetCode": "13-1121.00",
          "link": "",
          "description": "Organize and coordinate events, ensuring they run smoothly and meet client expectations.",
          "title": "Event Planner"
        }
      ]
    },
    {
      "id": "Enterprising_Openness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a dynamic and motivating energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to adapt to changes. Use your leadership skills to strengthen relationships and solve interpersonal challenges.\n",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Enterprising Adventurer, you thrive on taking innovative risks and leading new ventures. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Enterprising Adventurer",
      "areasToImprove": "\n- Patience: Practice being patient and allowing time for ideas to develop fully.\n- Detail-Oriented: Focus on the finer details to ensure thoroughness in your projects.\n- Feedback Reception: Learn to accept and use constructive criticism to improve your work.\n",
      "personalGoals": [
        "Practice Patience: Allow time for ideas to develop fully and consider all aspects before making decisions.",
        "Improve Detail-Oriented Skills: Focus on the finer details to ensure thoroughness in your projects.",
        "Enhance Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs an Enterprising Adventurer, you enjoy sharing your ideas and inspiring others. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your leadership.\n\n**Communicating with Friends:** Your friends appreciate your energy and innovative ideas. Make sure to listen to their thoughts and collaborate on projects together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your passion and enthusiasm are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your leadership and initiative. Share your visions with them and also take time to understand their viewpoints.\n\n**Effective Communication:** Use clear and persuasive language to convey your ideas, and practice active listening to ensure your audience feels heard and understood.\n",
      "closing": "Remember, these are just suggestions based on your Enterprising Adventurer personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "Engage in Group Projects: Collaborate with others to develop your leadership and teamwork skills."
      ],
      "workStyle": "\nYou thrive in environments where you can lead, innovate, and take on new challenges. You prefer tasks that allow for strategic thinking and creativity. Routine tasks might bore you, so look for opportunities to take on dynamic projects and drive change.\n",
      "inspirationalQuotes": [
        {
          "quote": "Business opportunities are like buses, there’s always another one coming.",
          "avatarURL": "",
          "name": "Richard Branson",
          "description": "A renowned entrepreneur and founder of the Virgin Group, Branson's quote emphasizes the importance of seizing opportunities and taking risks."
        },
        {
          "quote": "If you’re offered a seat on a rocket ship, don’t ask what seat! Just get on.",
          "avatarURL": "",
          "name": "Sheryl Sandberg",
          "description": "The COO of Facebook, Sandberg is known for her leadership and advocacy for women in business. Her quote highlights the importance of embracing opportunities and taking bold steps."
        },
        {
          "quote": "The biggest adventure you can take is to live the life of your dreams.",
          "avatarURL": "",
          "name": "Oprah Winfrey",
          "description": "Media mogul and philanthropist known for her inspirational leadership and ability to motivate others to pursue their dreams."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and leading teams.",
          "title": "Associate’s Degree in Business Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to develop and implement marketing strategies.",
          "title": "Certificate in Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to manage and promote public images.",
          "title": "Diploma in Public Relations"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring business owners and innovators.",
          "title": "Training Program in Entrepreneurship"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who want to enhance their leadership skills.",
          "title": "Certificate in Leadership"
        }
      ],
      "whatItMeans": "Being an Enterprising Adventurer means you are characterized by high levels of **Extraversion** and an **Enterprising** approach. **Extraversion** refers to being outgoing, energetic, and enjoying social interactions. **Enterprising** individuals enjoy leading, persuading, and managing projects or people.",
      "recommendedCareersOpening": "As an Enterprising Adventurer, your leadership and innovative thinking make you perfect for roles that involve managing projects, leading teams, and driving new ventures.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5202"
          ],
          "description": "Learn the fundamentals of managing and operating a business.",
          "title": "Business Administration"
        },
        {
          "link": "",
          "description": "Develop strategies to promote products and services effectively.",
          "cipCodes": [
            "5214"
          ],
          "title": "Marketing"
        },
        {
          "link": "",
          "description": "Study how to manage and promote the public image of organizations.",
          "cipCodes": [
            "909"
          ],
          "title": "Public Relations"
        },
        {
          "link": "",
          "description": "Learn the skills needed to start and run your own business.",
          "cipCodes": [
            "5207"
          ],
          "title": "Entrepreneurship"
        },
        {
          "link": "",
          "cipCodes": [
            "901",
            "907"
          ],
          "description": "Explore various forms of communication and their impact on society.",
          "title": "Communication Studies"
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "11-1021.00",
          "link": "",
          "description": "Start and manage your own business, bringing your vision to life.",
          "title": "Entrepreneur"
        },
        {
          "onetCode": "11-2021.00",
          "link": "",
          "description": "Develop strategies to promote products and services, and lead marketing campaigns.",
          "title": "Marketing Manager"
        },
        {
          "onetCode": "11-2022.00",
          "link": "",
          "description": "Lead a sales team to achieve targets and drive business growth.",
          "title": "Sales Manager"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "11-3031.00",
          "link": "",
          "description": "Plan, direct, or coordinate accounting, investing, banking, insurance, securities, and other financial activities of a branch, office, or department of an establishment.",
          "title": "Financial Managers"
        }
      ],
      "superpowers": " - Leadership: You have a natural ability to inspire and guide others towards common goals. - Risk Taking: You are willing to take bold steps and embrace new challenges. - Persuasion: Your charisma and communication skills help you to influence others effectively. - Innovation: You enjoy coming up with new ideas and strategies to solve problems. "
    },
    {
      "id": "Investigative_Agreeableness",
      "superpowers": "\n- Analytical Thinking: You excel at breaking down complex problems and finding logical solutions.\n- Attention to Detail: Your ability to notice small details helps you understand the bigger picture.\n- Curiosity: You are driven by a desire to learn and understand new things.\n- Critical Evaluation: You thoughtfully analyze information before forming conclusions.\n",
      "relationshipTips": "\nIn friendships and teamwork, you bring an insightful and analytical energy. You enjoy discussing ideas and learning from others. Be patient and understanding when others need more time to grasp complex concepts. Focus on using your analytical skills to strengthen relationships by understanding others' perspectives and needs.\n",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Inquisitive Analyst, you thoughtfully examine and interpret data, always seeking deeper understanding. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Inquisitive Analyst",
      "areasToImprove": "\n- Flexibility: Be open to different approaches and solutions.\n- Collaboration: Working with others can provide new perspectives and ideas.\n- Decision-Making: Practice making decisions more quickly and confidently.\n",
      "personalGoals": [
        "Practice Collaboration: Work with others on projects to gain new perspectives.",
        "Improve Flexibility: Be open to different approaches and solutions.",
        "Develop Decision-Making Skills: Make decisions more quickly and confidently.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs an Inquisitive Analyst, you enjoy deep conversations about topics that interest you. You prefer discussions that involve critical thinking and data analysis. Remember to listen actively and consider others' viewpoints to enrich your understanding.\n\n**Communicating with Friends:** Your friends appreciate your insightful nature and enjoy discussing ideas with you. Balance sharing your thoughts with listening to theirs.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your attention to detail and analytical mind are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your curiosity and thoughtfulness. Take time to share your discoveries and also listen to their perspectives.\n",
      "closing": "Remember, these are just suggestions based on your Inquisitive Analyst personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention."
      ],
      "workStyle": "\nYou thrive in environments where you can analyze data, solve problems, and conduct research. Routine tasks might bore you, so seek out projects that challenge your intellect and require detailed analysis. You prefer structured settings that allow you to focus on your work.\n",
      "inspirationalQuotes": [
        {
          "quote": "The most damaging phrase in the language is, ‘It's always been done that way.’",
          "avatarURL": "",
          "name": "Grace Hopper",
          "description": "A pioneering computer scientist and Navy rear admiral who developed the first compiler for a computer programming language, emphasizing innovation and critical thinking."
        },
        {
          "quote": "The world isn't getting any easier. With all these new inventions, I believe that people are hurried more and pushed more. The hurried way is not the right way; you need time for everything—time to work, time to play, time to rest.",
          "avatarURL": "",
          "name": "Hedy Lamarr",
          "description": "An actress and inventor whose work led to the development of spread-spectrum technology, highlighting the importance of thoughtful innovation and analysis."
        },
        {
          "quote": "What you do makes a difference, and you have to decide what kind of difference you want to make.",
          "avatarURL": "",
          "name": "Jane Goodall",
          "description": "A primatologist and anthropologist known for her groundbreaking research on chimpanzees and her dedication to conservation and animal welfare."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love analyzing data.",
          "title": "Associate’s Degree in Data Science"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in using data to drive business decisions.",
          "title": "Certificate in Business Analytics"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those interested in protecting digital information.",
          "title": "Diploma in Cybersecurity"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for detail-oriented individuals who love working with computers.",
          "title": "Apprenticeship in Information Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who enjoy analyzing consumer data and trends.",
          "title": "Training Program in Market Research"
        }
      ],
      "whatItMeans": "Being an Inquisitive Analyst means you are characterized by high levels of **Conscientiousness** and an **Investigative** approach. **Conscientiousness** refers to being organized, reliable, and thorough. **Investigative** individuals enjoy exploring ideas, analyzing information, and solving complex problems.",
      "recommendedCareersOpening": "As an Inquisitive Analyst, your knack for digging deep into data and finding patterns makes you perfect for roles that involve critical analysis and strategic insight.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Dive into the world of data analysis and interpretation.",
          "cipCodes": [
            "3030",
            "1101",
            "1104"
          ],
          "title": "Data Science"
        },
        {
          "link": "",
          "description": "Understand the complexities of economies and financial systems.",
          "cipCodes": [
            "4506"
          ],
          "title": "Economics"
        },
        {
          "link": "",
          "cipCodes": [
            "2705"
          ],
          "description": "Develop skills in statistical analysis and data interpretation.",
          "title": "Statistics"
        },
        {
          "link": "",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "description": "Explore the complexities of human behavior and mental processes.",
          "title": "Psychology"
        },
        {
          "link": "",
          "cipCodes": [
            "1401",
            "1402",
            "1403",
            "1404",
            "1405",
            "1406",
            "1407",
            "1408",
            "1409",
            "1410",
            "1411",
            "1412",
            "1413",
            "1414",
            "1418",
            "1419",
            "1420",
            "1421",
            "1422",
            "1423",
            "1424",
            "1425",
            "1427",
            "1428",
            "1432",
            "1433",
            "1434",
            "1435",
            "1436",
            "1437",
            "1438",
            "1439",
            "1499"
          ],
          "description": "Solve real-world problems with innovative engineering solutions.",
          "title": "Engineering"
        }
      ],
      "recommendedCareers": [
        {
          "description": "Interpret complex data sets to help businesses make informed decisions and improve efficiency.",
          "title": "Data Analyst",
          "link": "",
          "onetCode": "15-2051.00"
        },
        {
          "link": "",
          "description": "Study market conditions to understand potential sales of products or services and guide business strategies.",
          "onetCode": "13-1161.00",
          "title": "Market Research Analyst"
        },
        {
          "title": "Intelligence Analyst",
          "link": "",
          "onetCode": "33-3021.06",
          "description": "Gather and analyze information to assist in security and defense strategies."
        },
        {
          "title": "Business Analyst",
          "onetCode": "13-1111.00",
          "link": "",
          "description": "Assess business processes and systems to identify areas for improvement and recommend solutions."
        },
        {
          "title": "Health Informatics Specialist",
          "description": "Analyze and manage health information systems, improving the quality and efficiency of healthcare delivery.",
          "onetCode": "15-1211.01",
          "link": ""
        }
      ]
    },
    {
      "id": "Investigative_Conscientiousness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a thoughtful and insightful energy. You enjoy deep conversations and exploring ideas with friends. Just remember to be patient and understanding when others need more time to catch up with your thought process.\n",
      "recommendedCareers": [
        {
          "onetCode": "15-2051.00",
          "link": "",
          "description": "Analyze large sets of data to help organizations make informed decisions.",
          "title": "Data Scientist"
        },
        {
          "onetCode": "13-2051.00",
          "link": "",
          "description": "Evaluate financial data to guide investment decisions and strategies.",
          "title": "Financial Analyst"
        },
        {
          "onetCode": "15-2011.00",
          "link": "",
          "description": "Assess risk and uncertainty, using mathematical and statistical methods.",
          "title": "Actuary"
        },
        {
          "onetCode": "15-2031.00",
          "link": "",
          "description": "Use advanced mathematical and analytical methods to help organizations solve problems and make better decisions.",
          "title": "Operations Research Analyst"
        },
        {
          "onetCode": "15-1211.00",
          "link": "",
          "description": "Analyze and design information systems to help organizations operate more efficiently.",
          "title": "Computer Systems Analyst"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Analytical Mastermind, you excel in logical thinking and detailed investigations. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Analytical Mastermind",
      "areasToImprove": "\n- Balance: Try to balance your focus on details with a broader perspective to see the big picture.\n- Flexibility: Sometimes, being open to unconventional solutions can be beneficial.\n- Collaboration: Working with others can bring new insights, so practice teamwork and consider others' ideas.\n",
      "personalGoals": [
        "Complete a Research Project: Enhance your investigative skills with regular research challenges.",
        "Practice Flexibility: Try new activities outside your comfort zone to develop a more adaptable mindset.",
        "Set Learning Goals: Aim to learn something new each week, whether it’s a concept, skill, or hobby."
      ],
      "howYouCommunicate": "\nAs an Analytical Mastermind, your communication style is characterized by precision, depth, and logical structure. You prefer discussions that involve critical thinking and data analysis.\n\n**Communicating with Friends:** Your friends value your insightful observations and logical advice. Remember to balance intellectual discourse with lighter, more casual conversations.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your analytical nature can bring clarity to complex situations. Work on expressing your emotions alongside your thoughts to deepen your connection.\n\n**Communicating with Family:** Your family appreciates your problem-solving skills. Share your analytical insights with them, but also be open to more intuitive or emotional perspectives.\n\n**Effective Communication:** Use your natural analytical skills to break down complex ideas into digestible parts. Practice active listening to gather all necessary information before offering your analysis.\n",
      "closing": "Remember, these are just suggestions based on your Analytical Mastermind personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Structured Study Plan: Break down your study sessions into manageable chunks and set clear goals.",
        "Engage in Deep Learning: Go beyond surface learning and explore topics in depth to satisfy your curiosity.",
        "Incorporate Problem-Solving Activities: Use puzzles and problem-solving exercises to keep your mind sharp and engaged."
      ],
      "workStyle": "\nYou thrive in environments where you can analyze, investigate, and solve problems. Routine tasks might bore you, so look for opportunities that challenge your intellect and require critical thinking. You prefer structured settings where your analytical skills can shine.\n",
      "inspirationalQuotes": [
        {
          "quote": "Never limit yourself because of others’ limited imagination; never limit others because of your own limited imagination.",
          "avatarURL": "",
          "name": "Mae Jemison",
          "description": "The first African American woman to travel into space, Mae Jemison is a physician, engineer, and former NASA astronaut. Her diverse interests and achievements embody the spirit of curiosity and adaptability."
        },
        {
          "quote": "The important thing is not to stop questioning. Curiosity has its own reason for existence.",
          "avatarURL": "",
          "name": "Albert Einstein",
          "description": "A theoretical physicist known for his groundbreaking theories of relativity and his curious nature, making him an exemplary figure for Analytical Masterminds."
        },
        {
          "quote": "That brain of mine is something more than merely mortal; as time will show.",
          "avatarURL": "",
          "name": "Ada Lovelace",
          "description": "A mathematician and writer known for her work on Charles Babbage's early mechanical general-purpose computer, showcasing the power of analytical thinking and innovation."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love analyzing data.",
          "title": "Associate’s Degree in Data Science"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in computer systems and networks.",
          "title": "Certificate in Information Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy practical problem-solving.",
          "title": "Diploma in Civil Engineering Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for detail-oriented individuals who love working with their hands.",
          "title": "Apprenticeship in Precision Machining"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in protecting digital information.",
          "title": "Training Program in Cybersecurity"
        }
      ],
      "whatItMeans": "Being an Analytical Mastermind means you are characterized by high levels of Conscientiousness and an Investigative approach. Conscientiousness refers to being organized, reliable, and thorough. The Investigative trait indicates a preference for analytical, exploratory, and research-oriented activities. ",
      "recommendedCareersOpening": "As an Analytical Mastermind, your ability to dissect complex problems and find logical solutions makes you invaluable in fields that require critical thinking and precision. You excel in roles where detailed analysis and strategic planning are key.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Dive into the world of numbers and logical reasoning.",
          "cipCodes": [
            "2701",
            "2703",
            "2705",
            "2799"
          ],
          "title": "Mathematics"
        },
        {
          "link": "",
          "description": "Explore the fundamental principles governing the universe.",
          "cipCodes": [
            "4008"
          ],
          "title": "Physics"
        },
        {
          "link": "",
          "description": "Develop skills in programming and system analysis.",
          "cipCodes": [
            "1101",
            "1102",
            "1103",
            "1104",
            "1105"
          ],
          "title": "Computer Science"
        },
        {
          "link": "",
          "description": "Solve real-world problems with innovative engineering solutions.",
          "cipCodes": [
            "1401",
            "1402",
            "1403",
            "1404",
            "1405",
            "1406",
            "1407",
            "1408",
            "1409",
            "1410",
            "1411",
            "1412",
            "1413",
            "1414",
            "1418",
            "1419",
            "1420",
            "1421",
            "1422",
            "1423",
            "1424",
            "1425",
            "1427",
            "1428",
            "1432",
            "1433",
            "1434",
            "1435",
            "1436",
            "1437",
            "1438",
            "1439",
            "1499"
          ],
          "title": "Engineering"
        },
        {
          "link": "",
          "cipCodes": [
            "4506"
          ],
          "description": "Understand the complexities of economies and financial systems.",
          "title": "Economics"
        }
      ],
      "superpowers": " - Logical Thinker: You have a knack for understanding complex systems and solving problems logically. - Detail Oriented: You notice the small details that others might miss, making you excellent at precision tasks. - Inquisitive Nature: Your curiosity drives you to explore new ideas and theories. - Persistent Investigator: You are persistent in your quest for knowledge, always digging deeper to find the truth. "
    },
    {
      "id": "Investigative_Emotional-Stability",
      "relationshipTips": "In friendships and teamwork, you bring a thoughtful and insightful energy. Use your problem-solving skills to understand others' perspectives and needs. Be patient and understanding when others need more time to grasp complex concepts. Apply your analytical skills to strengthen relationships by finding practical solutions to interpersonal challenges.",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Methodical Problem Solver, you excel at maintaining composure while tackling complex issues. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Methodical Problem Solver",
      "areasToImprove": "* Flexibility: Be open to different approaches and solutions.\n* Collaboration: Working with others can provide new perspectives and ideas.\n* Creativity: Encourage yourself to think outside the box and explore innovative solutions.",
      "personalGoals": [
        "* Practice Flexibility: Be open to different approaches and solutions.",
        "* Improve Collaboration: Work with others on projects to gain new perspectives.",
        "* Enhance Creativity: Think outside the box and explore innovative solutions.",
        "* Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends appreciate your reliable advice and thoughtful insights. Balance sharing your thoughts with listening to theirs.\n* **Communicating in Romantic Relationships**: In romantic relationships, your stability and thoughtfulness are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n* **Communicating with Family**: Your family values your reliability and problem-solving skills. Take time to share your discoveries and also listen to their perspectives.",
      "closing": "Remember, these are just suggestions based on your Methodical Problem Solver personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Detailed Study Plan: Break down your study sessions into manageable tasks.",
        "* Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "* Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention."
      ],
      "workStyle": "You thrive in environments where you can analyze data, solve problems, and conduct research. You prefer structured settings that allow you to focus on your work and employ a systematic approach to tasks. Routine tasks might bore you, so seek out projects that challenge your intellect and require detailed analysis.",
      "inspirationalQuotes": [
        {
          "quote": "Science and everyday life cannot and should not be separated.",
          "avatarURL": "",
          "name": "Rosalind Franklin",
          "description": "A chemist whose work with X-ray diffraction was critical in understanding the molecular structures of DNA, showcasing the importance of meticulous research and analysis."
        },
        {
          "quote": "We will always have STEM with us. Some things will drop out of the public eye and will go away, but there will always be science, engineering, and technology. And there will always, always be mathematics.",
          "avatarURL": "",
          "name": "Katherine Johnson",
          "description": "A mathematician and physicist whose calculations of orbital mechanics were crucial to the success of U.S. spaceflights, highlighting the power of precision and analytical thinking."
        },
        {
          "quote": "What you do makes a difference, and you have to decide what kind of difference you want to make.",
          "avatarURL": "",
          "name": "Jane Goodall",
          "description": "A primatologist and anthropologist known for her groundbreaking research on chimpanzees and her dedication to conservation and animal welfare."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love analyzing data.",
          "title": "Associate’s Degree in Data Science"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in ensuring product standards.",
          "title": "Certificate in Quality Control"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those curious about sustainable solutions.",
          "title": "Diploma in Environmental Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for detail-oriented individuals who love investigating.",
          "title": "Training Program in Cybersecurity"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in designing efficient information systems.",
          "title": "Certificate in Systems Analysis"
        }
      ],
      "whatItMeans": "Being a Methodical Problem Solver means you are characterized by high levels of **Conscientiousness** and an **Investigative** approach. **Conscientiousness** refers to being organized, reliable, and thorough. **Investigative** individuals enjoy exploring ideas, analyzing information, and solving complex problems.",
      "recommendedCareersOpening": "As a Methodical Problem Solver, your ability to maintain composure and systematically solve problems makes you perfect for roles that involve critical analysis and strategic insight.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "3030",
            "1101",
            "1104"
          ],
          "description": "Dive into the world of data analysis and interpretation.",
          "title": "Data Science"
        },
        {
          "link": "",
          "description": "Develop problem-solving skills and apply them to real-world challenges.",
          "cipCodes": [
            "1401",
            "1402",
            "1403",
            "1404",
            "1405",
            "1406",
            "1407",
            "1408",
            "1409",
            "1410",
            "1411",
            "1412",
            "1413",
            "1414",
            "1418",
            "1419",
            "1420",
            "1421",
            "1422",
            "1423",
            "1424",
            "1425",
            "1427",
            "1428",
            "1432",
            "1433",
            "1434",
            "1435",
            "1436",
            "1437",
            "1438",
            "1439",
            "1499"
          ],
          "title": "Engineering"
        },
        {
          "link": "",
          "description": "Study the relationship between humans and the environment.",
          "cipCodes": [
            "301"
          ],
          "title": "Environmental Science"
        },
        {
          "link": "",
          "cipCodes": [
            "4008"
          ],
          "description": "Explore the fundamental principles governing the universe.",
          "title": "Physics"
        },
        {
          "link": "",
          "cipCodes": [
            "1101",
            "1102",
            "1103",
            "1104",
            "1105"
          ],
          "description": "Develop skills in programming and system analysis.",
          "title": "Computer Science"
        }
      ],
      "superpowers": " - Calm Under Pressure: You maintain your composure in stressful situations, allowing you to think clearly. - Systematic Approach: You use a methodical process to solve problems efficiently. - Attention to Detail: You notice the small details that are crucial to solving complex issues. - Perseverance: You are persistent in finding solutions, even when faced with difficult challenges. ",
      "recommendedCareers": [
        {
          "onetCode": "15-2051.00",
          "link": "",
          "title": "Data Analyst",
          "description": "Interpret complex data sets to help businesses make informed decisions and improve efficiency."
        },
        {
          "onetCode": "19-4099.01",
          "title": "Quality Control Analyst",
          "link": "",
          "description": "Ensure products meet quality standards by conducting tests and inspections."
        },
        {
          "title": "Operations Research Analyst",
          "link": "",
          "description": "Use advanced mathematical and analytical methods to help organizations solve problems and make better decisions.",
          "onetCode": "15-2031.00"
        },
        {
          "onetCode": "15-1211.00",
          "title": "Computer Systems Analyst",
          "link": "",
          "description": "Analyze and design information systems to help organizations operate more efficiently."
        },
        {
          "onetCode": "19-2041.00",
          "title": "Environmental Scientist",
          "description": "Conduct research to protect the environment, addressing issues like pollution and conservation.",
          "link": ""
        }
      ]
    },
    {
      "id": "Investigative_Extraversion",
      "superpowers": "\n- Insatiable Curiosity: Your drive to learn and understand fuels continuous exploration.\n- Analytical Thinking: You excel at breaking down complex problems and finding innovative solutions.\n- Enthusiasm for Discovery: Your excitement about new findings is contagious and motivating.\n- Persistence: You're willing to dig deep and persevere to uncover answers.\n",
      "relationshipTips": "\nIn friendships and teamwork, you bring an enthusiastic and curious energy. You enjoy discussing new ideas and learning from others. Just remember to be patient and understanding when others need more time to grasp complex concepts.\n",
      "recommendedCareers": [
        {
          "onetCode": "15-2051.00",
          "link": "",
          "description": "Analyze large sets of data to help organizations make informed decisions.",
          "title": "Data Scientist"
        },
        {
          "onetCode": "13-2051.00",
          "link": "",
          "description": "Evaluate financial data to guide investment decisions and strategies.",
          "title": "Financial Analyst"
        },
        {
          "onetCode": "15-2011.00",
          "link": "",
          "description": "Assess risk and uncertainty, using mathematical and statistical methods.",
          "title": "Actuary"
        },
        {
          "onetCode": "15-2031.00",
          "link": "",
          "description": "Use advanced mathematical and analytical methods to help organizations solve problems and make better decisions.",
          "title": "Operations Research Analyst"
        },
        {
          "onetCode": "15-1211.00",
          "link": "",
          "description": "Analyze and design information systems to help organizations operate more efficiently.",
          "title": "Computer Systems Analyst"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Curious Researcher, you energetically explore new scientific frontiers and enjoy diving deep into the unknown. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Curious Researcher",
      "areasToImprove": "\n- Practical Application: Work on translating theoretical knowledge into real-world solutions.\n- Focus: Learn to prioritize research topics to avoid spreading yourself too thin.\n- Communication: Practice explaining complex concepts in accessible ways to non-experts.\n",
      "personalGoals": [
        "Complete a Research Project: Regularly take on research challenges to enhance your skills.",
        "Practice Collaboration: Work with others on projects to gain new perspectives.",
        "Set Learning Goals: Aim to learn something new each week, whether it’s a concept, skill, or hobby."
      ],
      "howYouCommunicate": "\nAs a Curious Researcher, your communication style is marked by enthusiasm for sharing discoveries and a love for in-depth, intellectual discussions. You thrive on exchanging ideas and theories with others.\n\n**Communicating with Friends:** Your friends appreciate your wealth of knowledge and interesting insights. Remember to balance sharing information with listening to their experiences and viewpoints.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your intellectual curiosity can lead to stimulating conversations. Work on balancing deep discussions with emotional connection and everyday interactions.\n\n**Communicating with Family:** Your family values your expertise and inquisitive nature. Share your latest findings with them, but also show interest in their day-to-day lives and perspectives.\n\n**Effective Communication:** Use your natural curiosity to ask thought-provoking questions. Practice translating complex ideas into relatable concepts to engage a wider audience.\n",
      "closing": "Remember, these are just suggestions based on your Curious Researcher personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Set Clear Goals: Define what you want to learn and create a plan to achieve it.",
        "Engage in Deep Learning: Dive deep into subjects to gain a thorough understanding.",
        "Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention."
      ],
      "workStyle": "\nYou thrive in environments where you can investigate, analyze, and learn. Routine tasks might bore you, so seek out opportunities that challenge your intellect and allow for continuous learning. You prefer structured settings where your analytical skills can be fully utilized.\n",
      "inspirationalQuotes": [
        {
          "quote": "The important thing is not to stop questioning. Curiosity has its own reason for existence.",
          "avatarURL": "",
          "name": "Albert Einstein",
          "description": "A theoretical physicist known for his groundbreaking theories and insatiable curiosity, making him an exemplary figure for Curious Researchers."
        },
        {
          "quote": "Science and everyday life cannot and should not be separated.",
          "avatarURL": "",
          "name": "Rosalind Franklin",
          "description": "A chemist whose work with X-ray diffraction was critical in understanding the molecular structures of DNA, showcasing the importance of meticulous research and analysis."
        },
        {
          "quote": "We will always have STEM with us. Some things will drop out of the public eye and will go away, but there will always be science, engineering, and technology. And there will always, always be mathematics.",
          "avatarURL": "",
          "name": "Katherine Johnson",
          "description": "A mathematician and physicist whose calculations of orbital mechanics were crucial to the success of U.S. spaceflights, highlighting the power of curiosity and precision in scientific discovery."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for hands-on problem solvers.",
          "title": "Associate’s Degree in Laboratory Science"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those curious about sustainable solutions.",
          "title": "Certificate in Environmental Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those interested in biological innovations.",
          "title": "Diploma in Biotechnology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for detail-oriented individuals who love investigating.",
          "title": "Apprenticeship in Cybersecurity"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who enjoy detailed analysis and problem-solving.",
          "title": "Training Program in Forensic Science"
        }
      ],
      "whatItMeans": "Being a Curious Researcher means you are characterized by high levels of Openness to Experience and an Investigative approach. Openness refers to being imaginative, curious, and receptive to new ideas. The Investigative trait indicates a strong preference for analytical, exploratory, and research-oriented activities.",
      "recommendedCareersOpening": "As an Analytical Mastermind, your ability to dissect complex problems and find logical solutions makes you invaluable in fields that require critical thinking and precision. You excel in roles where detailed analysis and strategic planning are key.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "2601"
          ],
          "description": "Study living organisms and their interactions.",
          "title": "Biology"
        },
        {
          "link": "",
          "cipCodes": [
            "4008"
          ],
          "description": "Explore the fundamental principles governing the universe.",
          "title": "Physics"
        },
        {
          "link": "",
          "description": "Develop skills in programming and system analysis.",
          "cipCodes": [
            "1101",
            "1102",
            "1103",
            "1104",
            "1105"
          ],
          "title": "Computer Science"
        },
        {
          "link": "",
          "cipCodes": [
            "4005"
          ],
          "description": "Investigate the properties and reactions of matter.",
          "title": "Chemistry"
        },
        {
          "link": "",
          "description": "Understand the relationship between humans and the environment.",
          "cipCodes": [
            "301"
          ],
          "title": "Environmental Science"
        }
      ]
    },
    {
      "id": "Investigative_Openness",
      "superpowers": "\n- Curiosity: You have a strong desire to learn and explore new concepts and ideas.\n- Intuition: You trust your instincts and have a natural ability to understand complex situations.\n- Analytical Thinking: You excel at breaking down complex problems and finding logical solutions.\n- Creativity: You think outside the box and enjoy coming up with innovative ideas.\n",
      "relationshipTips": "\nIn friendships and teamwork, you bring a fun and adventurous energy. You enjoy sharing your discoveries and ideas with others. Be patient and understanding when others need more time to adapt to changes or new concepts. Balance your need for exploration with time spent nurturing your relationships.\n",
      "recommendedCareers": [
        {
          "onetCode": "19-2041.00",
          "link": "",
          "description": "Conduct research to protect the environment, addressing issues like pollution and conservation.",
          "title": "Environmental Scientist"
        },
        {
          "onetCode": "19-1021.00",
          "link": "",
          "description": "Study the chemical processes within and related to living organisms.",
          "title": "Biochemist"
        },
        {
          "onetCode": "15-1252.00",
          "link": "",
          "description": "Create and improve software applications, focusing on user needs and functionality.",
          "title": "Software Developer"
        },
        {
          "onetCode": "19-3051.00",
          "link": "",
          "description": "Develop plans and programs for land use in urban areas, focusing on creating sustainable and functional communities.",
          "title": "Urban Planner"
        },
        {
          "onetCode": "19-3091.00",
          "link": "",
          "description": "Study past human activity through the recovery and analysis of material culture.",
          "title": "Archaeologist"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Intuitive Explorer, you are driven by curiosity and an intuitive understanding of the world around you. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Intuitive Explorer",
      "areasToImprove": "\n- Focus: Try setting priorities to stay focused on your goals and avoid getting distracted by new ideas.\n- Follow-Through: Completing tasks can be challenging—consider breaking projects into smaller steps to make them more manageable.\n- Decision-Making: With many options available, practice narrowing down choices by weighing pros and cons.\n",
      "personalGoals": [
        "Complete a New Project Monthly: Enhance your problem-solving skills with regular challenges.",
        "Practice Decision-Making: Start with smaller, everyday choices to build confidence.",
        "Set Learning Goals: Aim to learn something new each week, whether it’s a concept, skill, or hobby.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others.",
        "Build Interpersonal Skills: Focus on improving your communication and teamwork abilities."
      ],
      "howYouCommunicate": "\nAs an Intuitive Explorer, you enjoy deep conversations about interesting topics and hearing different perspectives. You like to ask questions and share your ideas with others. Remember to listen carefully and consider others' thoughts, too.\n\n**Communicating with Friends:** Your friends appreciate your curiosity and the interesting discussions you bring to the table. Make sure to balance talking about your ideas with listening to theirs.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your intuition and creativity are key strengths. Be sure to express your feelings clearly and listen to your partner’s needs and emotions.\n\n**Communicating with Family:** Your family values your insightful nature. Take the time to share your discoveries and ideas with them, and also listen to their perspectives and advice.\n",
      "closing": "Remember, these are just suggestions based on your Intuitive Explorer personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Break Study Sessions into Smaller Chunks: Maintain focus and avoid distractions.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "Engage in Deep Learning: Focus on understanding the underlying principles and concepts.",
        "Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention."
      ],
      "workStyle": "\nYou thrive in environments where you can explore, experiment, and learn. You like having the freedom to try new approaches and think creatively. Routine tasks might bore you, so look for opportunities to take on new challenges and projects. Ideal work environments include research labs, innovative startups, or any setting that encourages experimentation and continuous learning.\n",
      "inspirationalQuotes": [
        {
          "quote": "I'm an explorer, okay? I like to find out!",
          "avatarURL": "",
          "name": "Richard Feynman",
          "description": "A renowned physicist known for his curiosity and love for discovery, embodying the spirit of the Intuitive Explorer."
        },
        {
          "quote": "The stars don't look bigger, but they do look brighter.",
          "avatarURL": "",
          "name": "Sally Ride",
          "description": "The first American woman in space, Sally Ride inspired many with her pioneering spirit and contributions to space exploration."
        },
        {
          "quote": "Somewhere, something incredible is waiting to be known.",
          "avatarURL": "",
          "name": "Carl Sagan",
          "description": "An astronomer and science communicator who inspired many with his sense of wonder and dedication to exploration."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for hands-on problem solvers.",
          "title": "Associate’s Degree in Laboratory Science"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those curious about sustainable solutions.",
          "title": "Certificate in Environmental Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those interested in creating and improving software.",
          "title": "Diploma in Software Development"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those who want to shape urban environments.",
          "title": "Training Program in Urban Planning"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in studying past human activity.",
          "title": "Certificate in Archaeology"
        }
      ],
      "whatItMeans": "Being an Intuitive Explorer means you are characterized by high levels of **Openness** and an **Investigative** approach. **Openness** refers to being imaginative, curious, and open to new experiences. **Investigative** individuals enjoy exploring ideas, analyzing information, and solving complex problems.",
      "recommendedCareersOpening": "As an Intuitive Explorer, your curiosity and analytical skills make you perfect for careers that involve investigation, exploration, and innovation.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "301"
          ],
          "description": "Investigate the relationship between humans and the environment.",
          "title": "Environmental Science"
        },
        {
          "link": "",
          "cipCodes": [
            "2601"
          ],
          "description": "Explore the intricacies of living organisms.",
          "title": "Biology"
        },
        {
          "link": "",
          "description": "Develop skills in programming and system analysis.",
          "cipCodes": [
            "1101",
            "1102",
            "1103",
            "1104",
            "1105"
          ],
          "title": "Computer Science"
        },
        {
          "link": "",
          "cipCodes": [
            "403"
          ],
          "description": "Learn how to design and develop urban areas.",
          "title": "Urban Planning"
        },
        {
          "link": "",
          "description": "Study human societies and cultural development.",
          "cipCodes": [
            "4502"
          ],
          "title": "Anthropology"
        }
      ]
    },
    {
      "id": "Realistic_Agreeableness",
      "relationshipTips": "In friendships and teamwork, you bring a caring and supportive energy. You enjoy helping others and making sure everyone is taken care of. Be patient and understanding when others need more time to adapt to your supportive approach.",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Practical Supporter, you excel at providing hands-on help and support to others. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Practical Supporter",
      "areasToImprove": "* Assertiveness: Work on standing up for yourself and expressing your needs clearly.\n* Independence: Develop your ability to work independently without always seeking approval from others.\n* Flexibility: Be open to new ideas and ways of doing things, even if they differ from your usual methods.",
      "personalGoals": [
        "* Improve Assertiveness: Practice expressing your needs and standing up for yourself.",
        "* Enhance Independence: Challenge yourself to complete tasks without seeking approval.",
        "* Increase Flexibility: Be open to new ideas and different ways of doing things.",
        "* Develop Digital Skills: Explore how technology can enhance your ability to help others.",
        "* Build Soft Skills: Improve teamwork, communication, and leadership abilities."
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends appreciate your supportive nature and willingness to lend a hand. Make sure to share your own experiences and thoughts, not just listen to theirs.\n* **Communicating in Romantic Relationships**: In romantic relationships, your empathy and kindness are key strengths. Be sure to communicate your own needs and desires clearly to maintain a balanced relationship.\n* **Communicating with Family**: Your family values your helpfulness and reliability. Take time to express your own opinions and stand up for yourself when needed.",
      "closing": "Remember, these are just suggestions based on your Practical Supporter personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Use Hands-On Learning: Engage in activities that allow you to apply what you learn in practical settings.",
        "* Create a Supportive Study Environment: Study with friends or classmates to stay motivated.",
        "* Break Down Tasks: Divide your study sessions into smaller, manageable chunks.",
        "* Set Realistic Goals: Break larger projects into achievable steps to maintain focus and motivation.",
        "* Utilize Technology: Leverage online tools and resources to enhance your learning experience."
      ],
      "workStyle": "You thrive in environments where you can provide practical support and assistance. You prefer tasks that involve helping others and using your hands. Routine tasks suit you well, and you find satisfaction in completing them efficiently.",
      "inspirationalQuotes": [
        {
          "quote": "Not all of us can do great things. But we can do small things with great love.",
          "avatarURL": "",
          "name": "Mother Teresa",
          "description": "A humanitarian known for her charitable work and compassion towards others, inspiring kindness and support."
        },
        {
          "quote": "There are three ways to ultimate success: The first way is to be kind. The second way is to be kind. The third way is to be kind.",
          "avatarURL": "",
          "name": "Fred Rogers",
          "description": "A beloved television personality known for his gentle and supportive nature, emphasizing the importance of kindness."
        },
        {
          "quote": "Every great dream begins with a dreamer. Always remember, you have within you the strength, the patience, and the passion to reach for the stars to change the world.",
          "avatarURL": "",
          "name": "Harriet Tubman",
          "description": "An abolitionist and activist who led many to freedom, showcasing strength, empathy, and determination."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those who want to become registered nurses.",
          "title": "Associate’s Degree in Nursing (ADN)"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Train to support physical therapists in patient care.",
          "title": "Certificate in Physical Therapy Assistance"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Learn to help patients improve their daily living skills.",
          "title": "Diploma in Occupational Therapy Assistance"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Prepare for a career in dental care.",
          "title": "Certificate in Dental Hygiene"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Gain skills in administrative and clinical tasks in healthcare settings.",
          "title": "Diploma in Medical Assisting"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Learn how to effectively support teachers and students in the classroom.",
          "title": "Teaching Apprenticeship"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Train to support social workers in providing services.",
          "title": "Diploma in Social Work Assistance"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Develop skills to effectively assist customers and resolve their issues.",
          "title": "Certificate in Customer Service"
        }
      ],
      "whatItMeans": "Being a Practical Supporter means you are characterized by high levels of **Agreeableness** and a **Realistic** approach. **Agreeableness** refers to being cooperative, kind, and compassionate towards others. **Realistic** individuals prefer practical, hands-on activities and are often skilled with tools and machinery.",
      "recommendedCareersOpening": "As a Practical Supporter, your helping nature and practical skills make you a great fit for careers that involve assisting others and performing hands-on tasks.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "5138"
          ],
          "description": "Learn to provide care and support for patients in various healthcare settings.",
          "title": "Nursing"
        },
        {
          "link": "",
          "description": "Study how to help patients recover from physical injuries and improve mobility.",
          "cipCodes": [
            "5123"
          ],
          "title": "Physical Therapy"
        },
        {
          "link": "",
          "description": "Train to assist patients in developing and improving their daily living skills.",
          "cipCodes": [
            "5123"
          ],
          "title": "Occupational Therapy"
        },
        {
          "link": "",
          "description": "Prepare for a career in preventative dental care.",
          "cipCodes": [
            "5106"
          ],
          "title": "Dental Hygiene"
        },
        {
          "link": "",
          "description": "Gain skills in both administrative and clinical tasks in healthcare.",
          "cipCodes": [
            "5108"
          ],
          "title": "Medical Assisting"
        },
        {
          "link": "",
          "description": "Learn how to support teachers and assist students in their learning.",
          "cipCodes": [
            "1301",
            "1312"
          ],
          "title": "Education"
        },
        {
          "link": "",
          "description": "Study how to support individuals and communities in need.",
          "cipCodes": [
            "4407"
          ],
          "title": "Social Work"
        },
        {
          "link": "",
          "description": "Prepare for a career in helping individuals and families access social services.",
          "cipCodes": [
            "4400"
          ],
          "title": "Human Services"
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "29-1141.00",
          "link": "",
          "description": "Provide medical care and support to patients.",
          "title": "Nurse"
        },
        {
          "onetCode": "31-2021.00",
          "link": "",
          "description": "Help patients recover from injuries and improve their physical abilities.",
          "title": "Physical Therapist Assistant"
        },
        {
          "onetCode": "31-2011.00",
          "link": "",
          "description": "Assist patients in developing, recovering, and improving the skills needed for daily living.",
          "title": "Occupational Therapy Assistant"
        },
        {
          "onetCode": "29-1292.00",
          "link": "",
          "description": "Clean teeth and provide other preventative dental care.",
          "title": "Dental Hygienist"
        },
        {
          "onetCode": "31-9092.00",
          "link": "",
          "description": "Perform administrative and clinical tasks in healthcare settings.",
          "title": "Medical Assistant"
        },
        {
          "onetCode": "25-9042.00",
          "link": "",
          "description": "Support teachers in the classroom, helping students with their learning activities.",
          "title": "Teaching Assistant"
        },
        {
          "onetCode": "21-1093.00",
          "link": "",
          "description": "Help social workers provide services to individuals and families in need.",
          "title": "Social Work Assistant"
        },
        {
          "onetCode": "43-4051.00",
          "link": "",
          "description": "Assist customers by providing information and resolving issues.",
          "title": "Customer Service Representative"
        }
      ],
      "superpowers": " - Helping Others: You have a natural ability to assist and support those around you. - Practical Skills: You are skilled at using tools and performing hands on tasks. - Reliability: People can count on you to be dependable and trustworthy. - Empathy: You understand and share the feelings of others, making you a great listener and friend. "
    },
    {
      "id": "Realistic_Conscientiousness",
      "recommendedCareers": [
        {
          "onetCode": "17-2141.00",
          "link": "",
          "description": "Design, develop, and test mechanical devices.",
          "title": "Mechanical Engineer"
        },
        {
          "onetCode": "11-9021.00",
          "link": "",
          "description": "Plan, direct, and coordinate construction projects.",
          "title": "Construction Manager"
        },
        {
          "onetCode": "49-3011.00",
          "link": "",
          "description": "Diagnose, adjust, repair, or overhaul aircraft engines and assemblies.",
          "title": "Aircraft Mechanic"
        },
        {
          "onetCode": "13-2011.00",
          "link": "",
          "description": "Manage financial records and ensure accuracy in financial reporting.",
          "title": "Accountant"
        },
        {
          "onetCode": "51-4041.00",
          "link": "",
          "description": "Set up and operate machine tools to produce precision parts and instruments.",
          "title": "Precision Machinist"
        },
        {
          "onetCode": "19-4042.00",
          "link": "",
          "description": "Perform laboratory and field tests to monitor environmental resources.",
          "title": "Environmental Science Technician"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Focused Achiever, you excel at methodically completing practical, hands-on tasks with precision and dedication. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Focused Achiever",
      "areasToImprove": "\n- Flexibility: Be open to adapting your methods when unexpected changes occur.\n- Big Picture Thinking: Practice considering long-term implications alongside immediate tasks.\n- Creativity: Allow yourself to explore innovative solutions alongside tried-and-true methods.\n",
      "personalGoals": [
        "Learn a New Technical Skill: Enhance your practical abilities by mastering a new tool or technique.",
        "Practice Adaptability: Take on projects that require you to adjust your approach as you go.",
        "Improve Team Collaboration: Seek opportunities to work on group projects and learn from others' perspectives."
      ],
      "howYouCommunicate": "\nAs a Focused Achiever, your communication style is characterized by clarity, precision, and practicality. You prefer straightforward conversations that lead to actionable outcomes.\n\n**Communicating with Friends:** Your friends value your dependability and practical advice. Remember to also engage in more relaxed, open-ended conversations to deepen connections.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your reliability and commitment are key strengths. Ensure you also express your emotions and appreciate the less tangible aspects of your relationship.\n\n**Communicating with Family:** Your family appreciates your hardworking nature and problem-solving skills. Share your accomplishments with them, but also show interest in their more abstract or emotional concerns.\n\n**Effective Communication:** Use your natural ability to break down complex tasks when explaining ideas. Practice active listening to ensure you fully understand others' needs before offering practical solutions.\n",
      "closing": "Remember, these are just suggestions based on your Focused Achiever personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests in practical, hands-on work, you have a bright future ahead!",
      "studyTips": [
        "Hands-On Practice: Whenever possible, apply theoretical knowledge to practical tasks.",
        "Create Detailed Checklists: Break down complex processes into step-by-step procedures.",
        "Teach Others: Reinforce your understanding by explaining concepts to peers."
      ],
      "workStyle": "\nYou thrive in environments where you can plan, organize, and execute hands-on tasks with precision. You prefer structured settings where you can manage your work efficiently and see concrete results. Your ability to focus on details makes you excellent at troubleshooting and quality control.\n",
      "inspirationalQuotes": [
        {
          "quote": "The scientists of today think deeply instead of clearly. One must be sane to think clearly, but one can think deeply and be quite insane.",
          "avatarURL": "",
          "name": "Nikola Tesla",
          "description": "A renowned inventor and engineer, Tesla's work laid the foundation for modern alternating current electric power systems."
        },
        {
          "quote": "Dreams are extremely important. You can't do it unless you imagine it.",
          "avatarURL": "",
          "name": "Ursula Burns",
          "description": "The first African American woman to serve as CEO of a Fortune 500 company (Xerox), Burns exemplifies the power of focused ambition and practical leadership."
        },
        {
          "quote": "Be passionate and bold. Always keep learning. You stop doing useful things if you don't learn.",
          "avatarURL": "",
          "name": "Satya Nadella",
          "description": "The CEO of Microsoft, Nadella emphasizes the importance of continuous improvement and practical innovation in the tech industry."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love hands-on problem-solving.",
          "title": "Associate's Degree in Mechanical Engineering Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in overseeing building projects.",
          "title": "Certificate in Construction Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those passionate about aircraft maintenance.",
          "title": "FAA Airframe and Powerplant Certification"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in creating high-precision parts.",
          "title": "Apprenticeship in Precision Machining"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to apply their skills to environmental protection.",
          "title": "Training Program in Environmental Monitoring"
        }
      ],
      "whatItMeans": "Being a Focused Achiever means you are characterized by high levels of Conscientiousness and a Realistic approach. Conscientiousness refers to being organized, reliable, and goal-oriented. The Realistic trait indicates a preference for practical, hands-on activities and tangible results.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn to design and manufacture mechanical systems.",
          "cipCodes": [
            "1419"
          ],
          "title": "Mechanical Engineering"
        },
        {
          "link": "",
          "description": "Develop skills in overseeing building projects.",
          "cipCodes": [
            "5220"
          ],
          "title": "Construction Management"
        },
        {
          "link": "",
          "cipCodes": [
            "5107"
          ],
          "description": "Study how to manage and organize health data.",
          "title": "Health Information Management"
        },
        {
          "link": "",
          "description": "Focus on creating high-quality products using advanced technologies.",
          "cipCodes": [
            "1506"
          ],
          "title": "Precision Manufacturing"
        },
        {
          "link": "",
          "cipCodes": [
            "301"
          ],
          "description": "Understand how to monitor and protect natural resources.",
          "title": "Environmental Science"
        }
      ],
      "relationshipTips": "In friendships and teamwork, you bring a dependable and practical energy. You enjoy helping others stay on track and reach their goals. Be patient with those who may not work as methodically as you do, and try to appreciate different working styles.  Friends: Offer your organizational skills to help with plans, but also be open to more spontaneous activities and different approaches to life.  Romantic Interests: Show your care through reliability and practical support, while also cultivating emotional intimacy and being open to new experiences.  Parents: Share your achievements and challenges, using your skills to contribute to family life while also making time for meaningful connections. Remember, balancing your practical nature with emotional awareness strengthens all your relationships.",
      "superpowers": " - Persistence: Your ability to stay focused on tasks until completion is remarkable. - Attention to Detail: You notice and manage the small details that others might overlook. - Practical Problem Solving: You excel at finding tangible solutions to real world challenges. - Reliability: Others can always count on you to follow through on your commitments. "
    },
    {
      "id": "Realistic_Emotional-Stability",
      "relationshipTips": "In friendships and teamwork, you bring a practical and reliable energy. You enjoy helping others solve problems and find efficient solutions. Be patient and understanding when others need more time to adapt to your practical approach.",
      "recommendedCareers": [
        {
          "onetCode": "17-2141.00",
          "link": "",
          "description": "Design, develop, and test mechanical devices and systems.",
          "title": "Mechanical Engineer"
        },
        {
          "onetCode": "17-2112.00",
          "link": "",
          "description": "Improve production processes to increase efficiency and reduce waste.",
          "title": "Industrial Engineer"
        },
        {
          "onetCode": "11-9021.00",
          "link": "",
          "description": "Plan, coordinate, and oversee construction projects from start to finish.",
          "title": "Construction Manager"
        },
        {
          "onetCode": "47-2111.00",
          "link": "",
          "description": "Install and maintain electrical systems in various settings.",
          "title": "Electrician"
        },
        {
          "onetCode": "11-3071.00",
          "link": "",
          "description": "Oversee the movement of goods and materials to ensure efficient delivery.",
          "title": "Logistics Manager"
        },
        {
          "onetCode": "15-1232.00",
          "link": "",
          "description": "Provide technical assistance and support for computer systems and networks.",
          "title": "IT Support Specialist"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Resourceful Pragmatist, you efficiently handle practical challenges and excel at finding solutions. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Resourceful Pragmatist",
      "areasToImprove": "* Delegation: Learn to trust others with tasks to build a stronger team.\n* Innovation: Encourage yourself to think creatively and explore new ideas.\n* Flexibility: Be open to different approaches and solutions, even if they differ from your usual methods.",
      "personalGoals": [
        "* Improve Delegation: Practice trusting others with tasks to build a stronger team.",
        "* Encourage Innovation: Challenge yourself to think creatively and explore new ideas.",
        "* Increase Flexibility: Be open to different approaches and solutions.",
        "* Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others.",
        "* Build Interpersonal Skills: Focus on improving your communication and teamwork abilities."
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends value your practical advice and solutions. Make sure to also share your thoughts and feelings, not just your solutions.\n* **Communicating in Romantic Relationships**: In romantic relationships, your reliability and practical nature are key strengths. Be sure to express your emotions and listen to your partner's needs and feelings.\n* **Communicating with Family**: Your family appreciates your dependable nature and problem-solving skills. Take time to listen to their perspectives and share your own ideas and feelings.",
      "closing": "Remember, these are just suggestions based on your Resourceful Pragmatist personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Organize Your Study Space: Create a tidy and efficient workspace to help you focus.",
        "* Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "* Use Real-World Examples: Apply what you learn to real-world scenarios to enhance retention.",
        "* Stay Active: Incorporate physical activity into your study routine to keep your energy levels high.",
        "* Incorporate Problem-Solving: Use your natural problem-solving skills to tackle complex study topics."
      ],
      "workStyle": "You thrive in environments where you can tackle practical problems and find efficient solutions. You prefer tasks that involve hands-on work and clear objectives. Routine tasks suit you well, and you excel in structured settings where you can organize and manage your work effectively.",
      "inspirationalQuotes": [
        {
          "quote": "Genius is one percent inspiration and ninety-nine percent perspiration.",
          "avatarURL": "",
          "name": "Thomas Edison",
          "description": "An inventor and businessman known for his practical approach to solving problems and his numerous inventions, including the electric light bulb."
        },
        {
          "quote": "You can’t use up creativity. The more you use, the more you have.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "A renowned author and poet who emphasized the importance of creativity and perseverance in overcoming challenges."
        },
        {
          "quote": "Where there is no vision, there is no hope.",
          "avatarURL": "",
          "name": "George Washington Carver",
          "description": "An agricultural scientist and inventor who promoted sustainable farming practices and developed numerous uses for crops like peanuts and sweet potatoes."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who enjoy designing and working with mechanical systems.",
          "title": "Associate’s Degree in Mechanical Engineering Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in improving industrial processes.",
          "title": "Certificate in Industrial Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to manage building projects.",
          "title": "Diploma in Construction Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Train to install and maintain electrical systems.",
          "title": "Certificate in Electrical Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Prepare for a career in managing the flow of goods.",
          "title": "Diploma in Logistics Management"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Develop skills to provide technical support for computer systems.",
          "title": "Certificate in IT Support"
        }
      ],
      "whatItMeans": "Being a Resourceful Pragmatist means you are characterized by high levels of **Conscientiousness** and a **Realistic** approach. **Conscientiousness** refers to being organized, reliable, and thorough. **Realistic** individuals prefer practical, hands-on activities and are often skilled with tools and machinery.",
      "recommendedCareersOpening": "As a Resourceful Pragmatist, your practical skills and efficiency make you a great fit for careers that involve hands-on tasks, problem-solving, and efficient management.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "1419"
          ],
          "description": "Study the design and development of mechanical systems.",
          "title": "Mechanical Engineering"
        },
        {
          "link": "",
          "cipCodes": [
            "1435"
          ],
          "description": "Learn how to improve production processes and increase efficiency.",
          "title": "Industrial Engineering"
        },
        {
          "link": "",
          "cipCodes": [
            "5220"
          ],
          "description": "Gain skills in planning and managing construction projects.",
          "title": "Construction Management"
        },
        {
          "link": "",
          "cipCodes": [
            "1410"
          ],
          "description": "Study the principles and applications of electrical systems.",
          "title": "Electrical Engineering"
        },
        {
          "link": "",
          "cipCodes": [
            "5213"
          ],
          "description": "Explore the management of the flow of goods and services.",
          "title": "Logistics and Supply Chain Management"
        },
        {
          "link": "",
          "description": "Develop expertise in computer systems and network support.",
          "cipCodes": [
            "1101",
            "1103"
          ],
          "title": "Information Technology"
        }
      ],
      "superpowers": " - Problem Solving: You are adept at finding practical solutions to everyday challenges. - Efficiency: You complete tasks quickly and effectively. - Adaptability: You can adjust to new situations and challenges with ease. - Dependability: Others can rely on you to get the job done right. "
    },
    {
      "id": "Realistic_Extraversion",
      "relationshipTips": "\nIn friendships and teamwork, you bring a lively and practical energy. You enjoy helping others with hands-on tasks and finding practical solutions to problems. Be patient and understanding when others need more time to adapt to your energetic pace.\n",
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Dynamic Doer, you thrive in hands-on environments where you can work directly with tools, machines, and physical tasks. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Dynamic Doer",
      "areasToImprove": "\n- Patience: Take the time to think through problems thoroughly before jumping into action.\n- Communication: Work on expressing your ideas clearly to others.\n- Planning: Focus on planning ahead to avoid last-minute rushes.\n",
      "personalGoals": [
        "Improve Patience: Practice taking a step back to think through problems before acting.",
        "Enhance Communication: Work on expressing your ideas clearly and listening to others.",
        "Focus on Planning: Develop your planning skills to manage tasks more effectively.",
        "Learn Digital Skills: Explore how technology can enhance your practical skills and open new career opportunities.",
        "Develop Soft Skills: Improve teamwork, leadership, and interpersonal skills to complement your technical abilities."
      ],
      "howYouCommunicate": "\nAs a Dynamic Doer, you are straightforward and direct in your communication. You prefer clear, concise conversations and appreciate when others do the same. Remember to take the time to listen to others' ideas and perspectives.\n\n**Communicating with Friends:** You bring a lively and practical energy to your friendships. Your friends appreciate your straightforward approach and your willingness to help with hands-on tasks. Make sure to listen actively to your friends' concerns and interests.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your energy and enthusiasm can be very engaging. Be mindful to express your feelings clearly and take the time to understand your partner's emotions and needs. Patience and open communication are key to building a strong connection.\n\n**Communicating with Family:** With family members, your practical and straightforward nature can help solve problems and get things done efficiently. However, remember to show empathy and listen to their perspectives, especially in emotionally charged situations.\n",
      "closing": "Remember, these are just suggestions based on your Dynamic Doer personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Use Hands-On Learning: Engage in activities that allow you to apply what you learn in practical settings.",
        "Break Down Tasks: Divide your study sessions into smaller, manageable chunks.",
        "Stay Active: Incorporate physical activity into your study routine to keep your energy levels high.",
        "Set Realistic Goals: Break larger projects into achievable steps to maintain focus and motivation.",
        "Utilize Technology: Leverage online tools and resources to enhance your learning experience."
      ],
      "workStyle": "\nYou thrive in environments where you can be active and use your hands. You prefer tasks that involve physical activity and practical problem-solving. Routine tasks might bore you, so look for opportunities to take on new challenges and work with different tools and technologies.\n",
      "inspirationalQuotes": [
        {
          "quote": "We will always have STEM with us. Some things will drop out of the public eye and will go away, but there will always be science, engineering, and technology. And there will always, always be mathematics.",
          "avatarURL": "",
          "name": "Katherine Johnson",
          "description": "A mathematician and physicist whose calculations of orbital mechanics were crucial to the success of U.S. spaceflights, highlighting the power of curiosity and precision in scientific discovery."
        },
        {
          "quote": "The important thing is not to stop questioning. Curiosity has its own reason for existence.",
          "avatarURL": "",
          "name": "Albert Einstein",
          "description": "A theoretical physicist known for his groundbreaking theories of relativity and his curious nature, making him an exemplary figure for inquisitive minds."
        },
        {
          "quote": "The biggest adventure you can take is to live the life of your dreams.",
          "avatarURL": "",
          "name": "Oprah Winfrey",
          "description": "A media mogul and philanthropist known for her inspirational leadership and ability to motivate others to pursue their dreams."
        }
      ],
      "whatItMeans": "Being a Dynamic Doer means you are characterized by high levels of **Extraversion** and a **Realistic** approach. **Extraversion** refers to being energetic, outgoing, and enjoying social interactions. **Realistic** individuals prefer practical, hands-on activities and are often skilled with tools and machinery.",
      "recommendedCareersOpening": "As a Dynamic Doer, your hands-on skills and enthusiasm make you a great fit for careers that involve physical activity, practical problem-solving, and working with tools and machinery.",
      "superpowers": " - Practicality: You have a strong ability to see what needs to be done and get it done efficiently. - Energy: You bring a high level of energy and enthusiasm to your tasks. - Hands On Skills: You excel at working with your hands and using tools and machinery. - Problem Solving: You enjoy figuring out how things work and finding practical solutions. ",
      "possibleMajors": [
        {
          "cipCodes": [
            "5220"
          ],
          "title": "Construction Management",
          "link": "",
          "description": "Learn the skills needed to manage construction projects."
        },
        {
          "link": "",
          "title": "Automotive Technology",
          "cipCodes": [
            "4706"
          ],
          "description": "Develop expertise in vehicle repair and maintenance."
        },
        {
          "description": "Study the principles and practices of electrical systems.",
          "cipCodes": [
            "1503"
          ],
          "title": "Electrical Engineering Technology",
          "link": ""
        },
        {
          "link": "",
          "title": "Carpentry",
          "description": "Learn the craft of building and repairing wooden structures.",
          "cipCodes": [
            "4602"
          ]
        },
        {
          "cipCodes": [
            "3105"
          ],
          "description": "Explore the science of human movement and physical activity.",
          "link": "",
          "title": "Kinesiology"
        },
        {
          "cipCodes": [
            "3103"
          ],
          "description": "Combine your interest in sports with business and management skills.",
          "title": "Sports Management",
          "link": ""
        },
        {
          "title": "Emergency Medical Services",
          "link": "",
          "cipCodes": [
            "5108"
          ],
          "description": "Train for a career in emergency response and healthcare."
        }
      ],
      "recommendedCareers": [
        {
          "onetCode": "47-2061.00",
          "title": "Construction Worker",
          "description": "Build and repair structures, working with various tools and materials.",
          "link": ""
        },
        {
          "onetCode": "49-3023.00",
          "description": "Diagnose and repair vehicle issues, using specialized tools and equipment.",
          "link": "",
          "title": "Automotive Technician"
        },
        {
          "onetCode": "47-2111.00",
          "description": "Install and maintain electrical systems in homes, businesses, and factories.",
          "link": "",
          "title": "Electrician"
        },
        {
          "onetCode": "47-2031.00",
          "description": "Construct and repair building frameworks and structures.",
          "title": "Carpenter",
          "link": ""
        },
        {
          "description": "Help patients improve their physical movement and manage pain.",
          "title": "Physical Therapist",
          "link": "",
          "onetCode": "29-1123.00"
        },
        {
          "description": "Train and develop athletes in various sports disciplines.",
          "title": "Sports Coach",
          "onetCode": "27-2022.00",
          "link": ""
        },
        {
          "title": "Emergency Medical Technicians",
          "onetCode": "29-2042.00",
          "link": "",
          "description": "Provide critical services during emergencies, including medical and rescue operations."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "cipCodes": [],
          "title": "Associate’s Degree in Construction Management",
          "description": "Perfect for those who love planning and executing building projects.",
          "link": ""
        },
        {
          "description": "Ideal for those interested in vehicle repair and maintenance.",
          "cipCodes": [],
          "title": "Certificate in Automotive Technology",
          "link": ""
        },
        {
          "title": "Diploma in Electrical Technology",
          "cipCodes": [],
          "link": "",
          "description": "Great for those who want to develop their skills in electrical systems."
        },
        {
          "cipCodes": [],
          "description": "Excellent for those interested in building and repairing structures.",
          "link": "",
          "title": "Training Program in Carpentry"
        },
        {
          "cipCodes": [],
          "title": "Certification in Physical Therapy Assistance",
          "link": "",
          "description": "Train to support physical therapists in patient care."
        },
        {
          "description": "Develop your coaching skills and knowledge in sports disciplines.",
          "cipCodes": [],
          "title": "Sports Coaching Certification",
          "link": ""
        },
        {
          "description": "Prepare for a career in emergency medical services.",
          "cipCodes": [],
          "title": "Emergency Medical Technician (EMT) Training",
          "link": ""
        }
      ]
    },
    {
      "id": "Realistic_Openness",
      "relationshipTips": "\nIn friendships and teamwork, you bring a fun and adventurous energy. You enjoy sharing your discoveries and ideas with others. Just remember to be patient and understanding when others need more time to adapt to changes or new concepts.\n",
      "recommendedCareers": [
        {
          "onetCode": "15-1252.00",
          "link": "",
          "description": "Create and improve software applications, focusing on user needs and functionality.",
          "title": "Software Developer"
        },
        {
          "onetCode": "19-2041.00",
          "link": "",
          "description": "Conduct research to protect the environment, addressing issues like pollution and conservation.",
          "title": "Environmental Scientist"
        },
        {
          "onetCode": "11-2021.00",
          "link": "",
          "description": "Oversee the development and lifecycle of products, ensuring they meet market demands and user needs.",
          "title": "Product Manager"
        },
        {
          "onetCode": "17-2031.00",
          "link": "",
          "description": "Design and develop medical devices and systems that improve patient care.",
          "title": "Biomedical Engineer"
        },
        {
          "onetCode": "19-3051.00",
          "link": "",
          "description": "Develop plans and programs for land use in urban areas, focusing on creating sustainable and functional communities.",
          "title": "Urban Planner"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As an Adaptable Experimenter, you have a fantastic mix of investigative skills and an open-minded approach to life. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Adaptable Experimenter",
      "personalGoals": [
        "Complete a New Project Monthly: Enhance your problem-solving skills with regular challenges.",
        "Practice Decision-Making: Start with smaller, everyday choices to build confidence.",
        "Set Learning Goals: Aim to learn something new each week, whether it’s a concept, skill, or hobby."
      ],
      "howYouCommunicate": "\nAs an Adaptable Experimenter, your communication style is marked by enthusiasm for ideas and a love of intellectual discourse. You enjoy exploring concepts from multiple angles and are always eager to learn from others.\n\n**Communicating with Friends:** Your friends appreciate your intellectual curiosity and ability to discuss a wide range of topics. Ensure you also listen to their ideas and experiences, not just share your latest discoveries.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your openness to new experiences can be exciting. Remember to balance intellectual conversations with emotional connection and stability.\n\n**Communicating with Family:** Your family values your innovative thinking and adaptability. Share your insights with them, but also be open to their more traditional perspectives.\n\n**Effective Communication:** Use your natural curiosity to ask thought-provoking questions. Practice active listening to fully understand others' viewpoints before sharing your own ideas.\n",
      "closing": "Remember, these are just suggestions based on your Adaptable Experimenter personality type. The most important thing is to notice your what gives you energy and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Break Study Sessions into Smaller Chunks: Maintain focus and avoid distractions.",
        "Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience."
      ],
      "workStyle": "\nYou thrive in environments where you can explore, experiment, and learn. You like having the freedom to try new approaches and think creatively. Routine tasks might bore you, so look for opportunities to take on new challenges and projects.\n",
      "inspirationalQuotes": [
        {
          "quote": "Nothing in life is to be feared; it is only to be understood. Now is the time to understand more so that we may fear less.",
          "avatarURL": "",
          "name": "Marie Curie",
          "description": "A pioneering physicist and chemist who conducted groundbreaking research on radioactivity. Her curiosity and dedication to scientific exploration make her an exemplary figure for Adaptable Experimenters."
        },
        {
          "quote": "The good thing about science is that it’s true whether or not you believe in it.",
          "avatarURL": "",
          "name": "Neil deGrasse Tyson",
          "description": "Neil deGrasse Tyson is a renowned astrophysicist, author, and science communicator known for making complex scientific concepts accessible to the public. As the director of the Hayden Planetarium in New York City and host of the popular TV series 'Cosmos: A Spacetime Odyssey,' Tyson has inspired countless individuals with his passion for the universe and his ability to engage audiences with his charismatic and approachable style. His work emphasizes the importance of curiosity, critical thinking, and a love for exploration, making him an excellent mentor for those who are Adaptable Experimenters."
        },
        {
          "quote": "Never limit yourself because of others’ limited imagination; never limit others because of your own limited imagination.",
          "avatarURL": "",
          "name": "Mae Jemison",
          "description": "The first African American woman to travel into space, Mae Jemison is a physician, engineer, and former NASA astronaut. Her diverse interests and achievements embody the spirit of curiosity and adaptability."
        }
      ],
      "whatItMeans": "Being an Adaptable Experimenter means you are characterized by high levels of Openness to Experience and an Investigative approach. Openness refers to being imaginative, curious, and receptive to new ideas. The Investigative trait indicates a preference for analytical, exploratory, and research-oriented activities.",
      "recommendedCareersOpening": "As an Adaptable Experimenter, you thrive in environments where you can test ideas, solve problems, and adapt to new challenges. Your flexibility and creativity make you perfect for roles that require innovative thinking and the ability to pivot quickly.",
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for hands-on problem solvers.",
          "title": "Associate’s Degree in Laboratory Science"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those curious about sustainable solutions.",
          "title": "Certificate in Environmental Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for animal lovers who enjoy practical tasks.",
          "title": "Diploma in Veterinary Technology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those who love experimenting and innovation.",
          "title": "Apprenticeship in Biotechnology"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for detail-oriented investigators.",
          "title": "Training Program in Forensic Science"
        }
      ],
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "2601"
          ],
          "description": "Explore the intricacies of living organisms.",
          "title": "Biology"
        },
        {
          "link": "",
          "cipCodes": [
            "4005"
          ],
          "description": "Dive into the reactions and properties of matter.",
          "title": "Chemistry"
        },
        {
          "link": "",
          "description": "Investigate the relationship between humans and the environment.",
          "cipCodes": [
            "301"
          ],
          "title": "Environmental Science"
        },
        {
          "link": "",
          "description": "Understand the complexities of human behavior.",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "title": "Psychology"
        },
        {
          "link": "",
          "cipCodes": [
            "5207"
          ],
          "description": "Study the traits of successful start-up business and founding teams.",
          "title": "Entrepreneurship"
        }
      ],
      "areasToImprove": "- Prioritization: Set clear priorities to stay focused and avoid distractions. - Task Completion: Break projects into smaller steps to finish tasks effectively. - Decision-Making: Narrow down options by weighing pros and cons to simplify choices.",
      "superpowers": " - Curious: You're curious and love learning new things. - Flexible: You're flexible and can adapt to changes easily. - Problem Solver: You enjoy solving problems and figuring out how things work. - Creative: You have a creative side and like to think outside the box. "
    },
    {
      "id": "Social_Agreeableness",
      "superpowers": "\n- Empathy: You have a natural ability to understand and share the feelings of others.\n- Advocacy: You are passionate about fighting for social causes and making a positive impact.\n- Communication: Your excellent communication skills help you convey your ideas clearly and effectively.\n- Supportiveness: You provide unwavering support to those in need, making them feel valued and understood.\n",
      "relationshipTips": "\nIn friendships and teamwork, you bring a supportive and cooperative energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to adapt to changes. Use your conflict resolution skills to strengthen relationships and solve interpersonal challenges.\n",
      "recommendedCareers": [
        {
          "onetCode": "21-1021.00",
          "link": "",
          "description": "Provide support and resources to individuals and families in need, addressing various social issues.",
          "title": "Social Worker"
        },
        {
          "onetCode": "11-9151.00",
          "link": "",
          "description": "Oversee social service programs and community organizations.",
          "title": "Community Service Manager"
        },
        {
          "onetCode": "21-1091.00",
          "link": "",
          "description": "Educate communities about health practices and advocate for public health improvements.",
          "title": "Public Health Educator"
        },
        {
          "onetCode": "11-9151.00",
          "link": "",
          "description": "Develop and manage programs that support the organization's mission and goals.",
          "title": "Nonprofit Program Coordinator"
        },
        {
          "onetCode": "21-1012.00",
          "link": "",
          "description": "Provide academic, career, and emotional support to students.",
          "title": "School Counselor"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Compassionate Advocate, you excel at empathizing with others and championing social causes. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Compassionate Advocate",
      "areasToImprove": "\n- Assertiveness: Practice asserting your own needs and opinions in addition to supporting others.\n- Self-Care: Ensure you take time to care for yourself to avoid burnout.\n- Decision-Making: Develop confidence in making decisions, even when they might not please everyone.\n",
      "personalGoals": [
        "Practice Assertiveness: Assert your own needs and opinions in addition to supporting others.",
        "Improve Self-Care: Ensure you take time to care for yourself to avoid burnout.",
        "Enhance Decision-Making: Develop confidence in making decisions, even when they might not please everyone.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs a Compassionate Advocate, you enjoy sharing your ideas and inspiring others. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your advocacy.\n\n**Communicating with Friends:** Your friends appreciate your supportive and understanding nature. Make sure to listen to their ideas and build on them together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your empathy and communication skills are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your ability to mediate conflicts and foster harmony. Share your insights with them and also take time to understand their viewpoints.\n\n**Effective Communication:** Use active listening, empathy, and clear articulation to ensure your ideas are understood and others feel heard.\n",
      "closing": "Remember, these are just suggestions based on your Compassionate Advocate personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Group Activities: Use group discussions and projects to enhance your learning experience.",
        "Engage in Reflective Practices: Reflect on your learning experiences to deepen your understanding."
      ],
      "workStyle": "\nYou thrive in environments where you can work collaboratively and help others succeed. You prefer tasks that involve interaction, teamwork, and consensus-building. Routine tasks might bore you, so look for opportunities to engage in group projects and leadership roles.\n",
      "inspirationalQuotes": [
        {
          "quote": "Do your little bit of good where you are; it's those little bits of good put together that overwhelm the world.",
          "avatarURL": "",
          "name": "Desmond Tutu",
          "description": "A Nobel Peace Prize laureate known for his role in the opposition to apartheid in South Africa, Tutu’s words emphasize the power of collective effort and small acts of kindness."
        },
        {
          "quote": "Peace begins with a smile.",
          "avatarURL": "",
          "name": "Mother Teresa",
          "description": "A missionary and Nobel Peace Prize laureate who dedicated her life to helping the poor, Mother Teresa’s quote highlights the importance of kindness and compassion in fostering peace."
        },
        {
          "quote": "One child, one teacher, one book, one pen can change the world.",
          "avatarURL": "",
          "name": "Malala Yousafzai",
          "description": "An education activist and the youngest Nobel Prize laureate, Malala’s advocacy for girls’ education demonstrates the impact of a compassionate and determined advocate."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in supporting individuals and communities.",
          "title": "Associate’s Degree in Human Services"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to provide guidance and support to others.",
          "title": "Certificate in Counseling"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those interested in promoting community health.",
          "title": "Diploma in Public Health"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those interested in providing direct support and advocacy.",
          "title": "Training Program in Social Work"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who want to manage and support nonprofit organizations.",
          "title": "Certificate in Nonprofit Management"
        }
      ],
      "whatItMeans": "Being a Compassionate Advocate means you are characterized by high levels of **Agreeableness** and a **Social** approach. **Agreeableness** refers to being compassionate, cooperative, and eager to help others. **Social** individuals enjoy interacting with others and thrive in group settings.",
      "recommendedCareersOpening": "As a Compassionate Advocate, your empathy and communication skills make you perfect for roles that involve teamwork, support, and mediation.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn how to support and advocate for individuals and communities.",
          "cipCodes": [
            "4407"
          ],
          "title": "Social Work"
        },
        {
          "link": "",
          "cipCodes": [
            "5122"
          ],
          "description": "Study health issues and work on improving community health.",
          "title": "Public Health"
        },
        {
          "link": "",
          "description": "Understand the complexities of human behavior and mental processes.",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "title": "Psychology"
        },
        {
          "link": "",
          "description": "Focus on teaching and supporting students of all ages.",
          "cipCodes": [
            "1301",
            "1312"
          ],
          "title": "Education"
        },
        {
          "link": "",
          "description": "Develop skills to manage and lead nonprofit organizations.",
          "cipCodes": [
            "5202",
            "5203"
          ],
          "title": "Nonprofit Management"
        }
      ]
    },
    {
      "id": "Social_Conscientiousness",
      "superpowers": "\n- Empathy: You have a natural ability to understand and share the feelings of others.\n- Conflict Resolution: You excel at mediating conflicts and finding solutions that satisfy everyone involved.\n- Teamwork: You thrive in collaborative environments and help bring out the best in your team members.\n- Communication: Your excellent communication skills help you convey ideas clearly and effectively.\n",
      "relationshipTips": "\nIn friendships and teamwork, you bring a supportive and cooperative energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to adapt to changes. Use your conflict resolution skills to strengthen relationships and solve interpersonal challenges.\n",
      "recommendedCareers": [
        {
          "onetCode": "13-1071.00",
          "link": "",
          "description": "Manage recruitment, employee relations, and training programs within organizations.",
          "title": "Human Resources Specialist"
        },
        {
          "onetCode": "21-1012.00",
          "link": "",
          "description": "Provide academic, career, and emotional support to students.",
          "title": "School Counselor"
        },
        {
          "onetCode": "21-1021.00",
          "link": "",
          "description": "Provide support and resources to individuals and families in need, addressing various social issues.",
          "title": "Social Worker"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "23-1022.00",
          "link": "",
          "description": "Facilitate negotiations and conflict resolution between parties to reach mutual agreements.",
          "title": "Mediator"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Collaborative Diplomat, you excel at fostering teamwork and mediating conflicts to create harmonious and effective groups. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Collaborative Diplomat",
      "areasToImprove": "\n- Assertiveness: Practice asserting your own needs and opinions in addition to supporting others.\n- Decision-Making: Develop confidence in making decisions, even when they might not please everyone.\n- Boundaries: Set and maintain personal boundaries to ensure your own well-being.\n",
      "personalGoals": [
        "Practice Assertiveness: Assert your own needs and opinions in addition to supporting others.",
        "Improve Decision-Making: Develop confidence in making decisions, even when they might not please everyone.",
        "Set Boundaries: Ensure your own well-being by setting and maintaining personal boundaries.",
        "Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "howYouCommunicate": "\nAs a Collaborative Diplomat, you enjoy sharing your ideas and inspiring others. You are enthusiastic about discussing new concepts and possibilities. Remember to listen to others and incorporate their feedback to enhance your collaboration.\n\n**Communicating with Friends:** Your friends appreciate your supportive and understanding nature. Make sure to listen to their ideas and build on them together.\n\n**Communicating in Romantic Relationships:** In romantic relationships, your empathy and communication skills are key strengths. Ensure you also express your feelings and understand your partner’s emotions.\n\n**Communicating with Family:** Your family values your ability to mediate conflicts and foster harmony. Share your insights with them and also take time to understand their viewpoints.\n\n**Effective Communication:** Use active listening, empathy, and clear articulation to ensure your ideas are understood and others feel heard.\n",
      "closing": "Remember, these are just suggestions based on your Collaborative Diplomat personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "Incorporate Group Activities: Use group discussions and projects to enhance your learning experience.",
        "Engage in Reflective Practices: Reflect on your learning experiences to deepen your understanding."
      ],
      "workStyle": "\nYou thrive in environments where you can work collaboratively and help others succeed. You prefer tasks that involve interaction, teamwork, and consensus-building. Routine tasks might bore you, so look for opportunities to engage in group projects and leadership roles.\n",
      "inspirationalQuotes": [
        {
          "quote": "Do your little bit of good where you are; it's those little bits of good put together that overwhelm the world.",
          "avatarURL": "",
          "name": "Desmond Tutu",
          "description": "A Nobel Peace Prize laureate known for his role in the opposition to apartheid in South Africa, Tutu’s words emphasize the power of collective effort and small acts of kindness."
        },
        {
          "quote": "Peace begins with a smile.",
          "avatarURL": "",
          "name": "Mother Teresa",
          "description": "A missionary and Nobel Peace Prize laureate who dedicated her life to helping the poor, Mother Teresa’s quote highlights the importance of kindness and compassion in fostering peace."
        },
        {
          "quote": "It is better to lead from behind and to put others in front, especially when you celebrate victory when nice things occur. You take the front line when there is danger. Then people will appreciate your leadership.",
          "avatarURL": "",
          "name": "Nelson Mandela",
          "description": "A former president of South Africa and anti-apartheid revolutionary, Mandela’s leadership style exemplifies the importance of humility, courage, and putting others first."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in supporting individuals and communities.",
          "title": "Associate’s Degree in Human Services"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to provide guidance and support to others.",
          "title": "Certificate in Counseling"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to help resolve disputes and foster harmony.",
          "title": "Diploma in Mediation and Conflict Resolution"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those interested in providing direct support and advocacy.",
          "title": "Training Program in Social Work"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who want to manage and support employees within organizations.",
          "title": "Certificate in Human Resources"
        }
      ],
      "whatItMeans": "Being a Collaborative Diplomat means you are characterized by high levels of **Agreeableness** and a **Social** approach. **Agreeableness** refers to being compassionate, cooperative, and eager to help others. **Social** individuals enjoy interacting with others and thrive in group settings.",
      "recommendedCareersOpening": "As a Collaborative Diplomat, your empathy and communication skills make you perfect for roles that involve teamwork, support, and mediation.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "description": "Study the human mind and behavior to better understand and help others.",
          "title": "Psychology"
        },
        {
          "link": "",
          "description": "Learn how to support and advocate for individuals and communities.",
          "cipCodes": [
            "4407"
          ],
          "title": "Social Work"
        },
        {
          "link": "",
          "cipCodes": [
            "5210"
          ],
          "description": "Develop skills in managing and supporting employees within organizations.",
          "title": "Human Resources Management"
        },
        {
          "link": "",
          "description": "Explore various forms of communication and their impact on society.",
          "cipCodes": [
            "901",
            "907"
          ],
          "title": "Communication Studies"
        },
        {
          "link": "",
          "description": "Focus on teaching and supporting students of all ages.",
          "cipCodes": [
            "1301",
            "1312"
          ],
          "title": "Education"
        }
      ],
      "active": true
    },
    {
      "id": "Social_Emotional-Stability",
      "relationshipTips": "In friendships and teamwork, you bring a supportive and cooperative energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to adapt to changes. Use your conflict resolution skills to strengthen relationships and solve interpersonal challenges.",
      "recommendedCareers": [
        {
          "onetCode": "13-1071.00",
          "link": "",
          "description": "Manage recruitment, employee relations, and training programs within organizations.",
          "title": "Human Resources Specialist"
        },
        {
          "onetCode": "21-1012.00",
          "link": "",
          "description": "Provide academic, career, and emotional support to students.",
          "title": "School Counselor"
        },
        {
          "onetCode": "21-1021.00",
          "link": "",
          "description": "Provide support and resources to individuals and families in need, addressing various social issues.",
          "title": "Social Worker"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "23-1022.00",
          "link": "",
          "description": "Facilitate negotiations and conflict resolution between parties to reach mutual agreements.",
          "title": "Mediator"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Steady Peacemaker, you excel at maintaining harmony and fostering positive relationships. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Steady Peacemaker",
      "areasToImprove": "* Assertiveness: Practice asserting your own needs and opinions in addition to supporting others.\n* Decision-Making: Develop confidence in making decisions, even when they might not please everyone.\n* Self-Care: Ensure you take time to care for yourself to avoid burnout.",
      "personalGoals": [
        "* Practice Assertiveness: Assert your own needs and opinions in addition to supporting others.",
        "* Improve Decision-Making: Develop confidence in making decisions, even when they might not please everyone.",
        "* Enhance Self-Care: Ensure you take time to care for yourself to avoid burnout.",
        "* Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "closing": "Remember, these are just suggestions based on your Steady Peacemaker personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "* Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "* Incorporate Group Activities: Use group discussions and projects to enhance your learning experience.",
        "* Engage in Reflective Practices: Reflect on your learning experiences to deepen your understanding."
      ],
      "workStyle": "You thrive in environments where you can work collaboratively and help others succeed. You prefer tasks that involve interaction, teamwork, and consensus-building. Routine tasks might bore you, so look for opportunities to engage in group projects and leadership roles.",
      "inspirationalQuotes": [
        {
          "quote": "It is better to lead from behind and to put others in front, especially when you celebrate victory when nice things occur. You take the front line when there is danger. Then people will appreciate your leadership.",
          "avatarURL": "",
          "name": "Nelson Mandela",
          "description": "A former president of South Africa and anti-apartheid revolutionary, Mandela’s leadership style exemplifies the importance of humility, courage, and putting others first."
        },
        {
          "quote": "Peace begins with a smile.",
          "avatarURL": "",
          "name": "Mother Teresa",
          "description": "A missionary and Nobel Peace Prize laureate who dedicated her life to helping the poor, Mother Teresa’s quote highlights the importance of kindness and compassion in fostering peace."
        },
        {
          "quote": "Our prime purpose in this life is to help others. And if you can’t help them, at least don’t hurt them.",
          "avatarURL": "",
          "name": "Dalai Lama",
          "description": "A spiritual leader of Tibet, known for his teachings on compassion and peace."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in supporting individuals and communities.",
          "title": "Associate’s Degree in Human Services"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to provide guidance and support to others.",
          "title": "Certificate in Counseling"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to help resolve disputes and foster harmony.",
          "title": "Diploma in Mediation and Conflict Resolution"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those interested in providing direct support and advocacy.",
          "title": "Training Program in Social Work"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who want to manage and support employees within organizations.",
          "title": "Certificate in Human Resources"
        }
      ],
      "whatItMeans": "Being a Steady Peacemaker means you are characterized by high levels of **Emotional Stability** and a **Social** approach. **Emotional Stability** refers to being calm, resilient, and composed under pressure. **Social** individuals enjoy interacting with others and thrive in group settings.",
      "recommendedCareersOpening": "As a Steady Peacemaker, your empathy and communication skills make you perfect for roles that involve teamwork, support, and mediation.",
      "possibleMajors": [
        {
          "link": "",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "description": "Study the human mind and behavior to better understand and help others.",
          "title": "Psychology"
        },
        {
          "link": "",
          "description": "Learn how to support and advocate for individuals and communities.",
          "cipCodes": [
            "4407"
          ],
          "title": "Social Work"
        },
        {
          "link": "",
          "description": "Develop skills in managing and supporting employees within organizations.",
          "cipCodes": [
            "5210"
          ],
          "title": "Human Resources Management"
        },
        {
          "link": "",
          "description": "Explore various forms of communication and their impact on society.",
          "cipCodes": [
            "901",
            "907"
          ],
          "title": "Communication Studies"
        },
        {
          "link": "",
          "cipCodes": [
            "1301",
            "1302",
            "1312"
          ],
          "description": "Focus on teaching and supporting students of all ages.",
          "title": "Education"
        }
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends appreciate your supportive and understanding nature. Make sure to listen to their ideas and build on them together.* **Communicating in Romantic Relationships**: In romantic relationships, your empathy and calm demeanor are key strengths. Ensure you also express your feelings and understand your partner’s emotions.* **Communicating with Family**: Your family values your ability to mediate conflicts and foster harmony. Share your insights with them and also take time to understand their viewpoints.* **Effective Communication**: Use active listening, empathy, and clear articulation to ensure your ideas are understood and others feel heard.",
      "superpowers": " - Calmness: You remain composed and collected, even in stressful situations. - Empathy: You have a natural ability to understand and share the feelings of others. - Conflict Resolution: You excel at mediating conflicts and finding solutions that satisfy everyone involved. - Teamwork: You thrive in collaborative environments and help bring out the best in your team members. "
    },
    {
      "id": "Social_Extraversion",
      "relationshipTips": "In friendships and teamwork, you bring a creative and charismatic energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.",
      "recommendedCareers": [
        {
          "onetCode": "27-1024.00",
          "link": "",
          "description": "Create visual concepts to communicate ideas and captivate consumers.",
          "title": "Graphic Designer"
        },
        {
          "onetCode": "27-3031.00",
          "link": "",
          "description": "Manage and maintain a positive public image for clients, communicating effectively with the media and public.",
          "title": "Public Relations Specialist"
        },
        {
          "onetCode": "27-3043.00",
          "link": "",
          "description": "Write compelling and persuasive content for advertisements, websites, and other media.",
          "title": "Copywriter"
        },
        {
          "onetCode": "13-1161.00",
          "link": "",
          "description": "Develop and implement marketing strategies to promote products and services.",
          "title": "Marketing Specialist"
        },
        {
          "onetCode": "27-1014.00",
          "link": "",
          "description": "Create animation and visual effects for media such as television, movies, and video games.",
          "title": "Multimedia Artist and Animator"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Social Creator, you use your artistic talents and charm to captivate and inspire others. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Social Creator",
      "areasToImprove": "* Focus: Ensure you allocate enough time to complete your projects.\n* Practicality: Balance your creative ideas with practical steps to implement them.\n* Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
      "personalGoals": [
        "* Practice Focus: Allocate enough time to complete your projects.",
        "* Improve Practicality: Break down your visionary ideas into actionable steps.",
        "* Enhance Feedback Reception: Learn to accept and use constructive criticism to improve your work.",
        "* Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "closing": "Remember, these are just suggestions based on your Social Creator personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "* Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "* Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "* Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "You thrive in environments where you can be creative and interact with others. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, and media production companies.",
      "inspirationalQuotes": [
        {
          "quote": "I paint myself because I am so often alone and because I am the subject I know best.",
          "avatarURL": "",
          "name": "Frida Kahlo",
          "description": "A renowned painter known for her surreal and vibrant works, Frida Kahlo's art was deeply personal and imaginative."
        },
        {
          "quote": "You can’t use up creativity. The more you use, the more you have.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "A celebrated author and poet who emphasized the importance of creativity and perseverance in overcoming challenges."
        },
        {
          "quote": "The biggest adventure you can take is to live the life of your dreams.",
          "avatarURL": "",
          "name": "Oprah Winfrey",
          "description": "A media mogul and philanthropist known for her inspirational leadership and ability to motivate others to pursue their dreams."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who love visual creativity.",
          "title": "Associate’s Degree in Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in managing and promoting public images.",
          "title": "Certificate in Public Relations"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who enjoy writing persuasive content.",
          "title": "Diploma in Copywriting"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for aspiring marketing specialists.",
          "title": "Training Program in Marketing"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those interested in creating animations and visual effects.",
          "title": "Certificate in Multimedia Arts"
        }
      ],
      "whatItMeans": "Being a Social Creator means you are characterized by high levels of **Extraversion** and an **Artistic** approach. **Extraversion** refers to being outgoing, energetic, and enjoying social interactions. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and communication.",
      "recommendedCareersOpening": "As a Social Creator, your creativity and charisma make you perfect for roles that involve communication, design, and artistic expression.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Learn the principles of visual communication and design.",
          "cipCodes": [
            "5004"
          ],
          "title": "Graphic Design"
        },
        {
          "link": "",
          "cipCodes": [
            "909"
          ],
          "description": "Study how to manage and promote the public image of organizations.",
          "title": "Public Relations"
        },
        {
          "link": "",
          "cipCodes": [
            "5214"
          ],
          "description": "Develop strategies to promote products and services effectively.",
          "title": "Marketing"
        },
        {
          "link": "",
          "description": "Hone your skills in writing fiction, poetry, and creative non-fiction.",
          "cipCodes": [
            "2313"
          ],
          "title": "Creative Writing"
        },
        {
          "link": "",
          "description": "Explore various forms of communication and their impact on society.",
          "cipCodes": [
            "901",
            "907"
          ],
          "title": "Communication Studies"
        }
      ],
      "howYouCommunicate": "* **Communicating with Friends**: Your friends appreciate your creativity and charisma. Make sure to listen to their ideas and build on them together.* **Communicating in Romantic Relationships**: In romantic relationships, your imagination and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions.* **Communicating with Family**: Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints.* **Effective Communication**: Use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.",
      "superpowers": " - Creativity: You excel at generating new and original works that captivate audiences. - Charisma: Your natural charm and energy attract and inspire others. - Persuasive Communication: You can effectively convey your ideas and persuade others through your artistic expression. - Passion: Your enthusiasm for your craft motivates those around you. "
    },
    {
      "id": "Social_Openness",
      "relationshipTips": "In friendships and teamwork, you bring a creative and supportive energy. You enjoy sharing your ideas and inspiring others. Be patient and understanding when others need more time to grasp your visionary concepts. Use your creativity to find ways to connect and collaborate effectively. Apply your innovative thinking to strengthen relationships and solve interpersonal challenges.",
      "recommendedCareers": [
        {
          "onetCode": "29-1125.00",
          "link": "",
          "description": "Use art as a form of therapy to help clients express emotions and improve their mental health.",
          "title": "Art Therapist"
        },
        {
          "onetCode": "21-1012.00",
          "link": "",
          "description": "Provide academic, career, and emotional support to students.",
          "title": "School Counselor"
        },
        {
          "onetCode": "21-1015.00",
          "link": "",
          "description": "Help individuals identify and achieve their career goals through guidance and support.",
          "title": "Career Coach"
        },
        {
          "onetCode": "21-1021.00",
          "link": "",
          "description": "Provide support and resources to individuals and families in need, addressing various social issues.",
          "title": "Social Worker"
        },
        {
          "onetCode": "13-1071.00",
          "link": "",
          "description": "Manage recruitment, employee relations, and training programs within organizations.",
          "title": "Human Resources Specialist"
        }
      ],
      "shortDescription": "Congratulations on discovering your unique combination of strengths! As a Thoughtful Guide, you excel at providing insightful and creative mentorship to others. Let's explore what makes you special and how you can make the most of your talents.",
      "title": "Thoughtful Guide",
      "areasToImprove": "* Practicality: Balance your creative ideas with practical steps to implement them.\n* Assertiveness: Practice asserting your own needs and opinions in addition to supporting others.\n* Organization: Develop strategies to keep your projects and mentorship sessions on track.",
      "personalGoals": [
        "* Practice Practicality: Break down your visionary ideas into actionable steps.",
        "* Improve Assertiveness: Practice asserting your own needs and opinions in addition to supporting others.",
        "* Enhance Organization: Develop strategies to keep your projects and mentorship sessions on track.",
        "* Develop Emotional Intelligence: Work on understanding and managing your own emotions, as well as empathizing with others."
      ],
      "closing": "Remember, these are just suggestions based on your Thoughtful Guide personality type. The most important thing is to follow your passions and keep exploring the world around you. With your unique mix of skills and interests, you have a bright future ahead!",
      "studyTips": [
        "* Create a Flexible Study Schedule: Allow for exploration and creativity in your study routine.",
        "* Set Clear Goals: Break down your study sessions into manageable tasks with specific goals.",
        "* Incorporate Hands-On Activities: Use real-world examples to enhance your learning experience.",
        "* Engage in Creative Approaches: Use mind maps, visual aids, and storytelling to make learning more engaging and memorable."
      ],
      "workStyle": "You thrive in environments where you can be creative and explore new ideas while helping others. You prefer tasks that allow for innovation and self-expression. Routine tasks might bore you, so look for opportunities to take on creative projects and think outside the box. Ideal work environments include creative agencies, design studios, educational institutions, and counseling centers.",
      "inspirationalQuotes": [
        {
          "quote": "What you do makes a difference, and you have to decide what kind of difference you want to make.",
          "avatarURL": "",
          "name": "Jane Goodall",
          "description": "A primatologist and anthropologist known for her groundbreaking research on chimpanzees and her dedication to conservation and animal welfare."
        },
        {
          "quote": "You can’t use up creativity. The more you use, the more you have.",
          "avatarURL": "",
          "name": "Maya Angelou",
          "description": "A renowned author and poet who emphasized the importance of creativity and perseverance in overcoming challenges."
        },
        {
          "quote": "The best way to find yourself is to lose yourself in the service of others.",
          "avatarURL": "",
          "name": "Mahatma Gandhi",
          "description": "A leader known for his nonviolent resistance and dedication to social justice, inspiring countless individuals to work for positive change."
        }
      ],
      "possibleProfessionalPrograms": [
        {
          "link": "",
          "cipCodes": [],
          "description": "Ideal for those interested in supporting individuals and communities.",
          "title": "Associate’s Degree in Human Services"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Perfect for those who want to provide guidance and support to others.",
          "title": "Certificate in Counseling"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Great for those who want to use creativity to help others.",
          "title": "Diploma in Art Therapy"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Suitable for those interested in providing direct support and advocacy.",
          "title": "Training Program in Social Work"
        },
        {
          "link": "",
          "cipCodes": [],
          "description": "Excellent for those who want to manage and support employees within organizations.",
          "title": "Certificate in Human Resources"
        }
      ],
      "whatItMeans": "Being a Thoughtful Guide means you are characterized by high levels of **Agreeableness** and an **Artistic** approach. **Agreeableness** refers to being compassionate, cooperative, and eager to help others. **Artistic** individuals enjoy creating and expressing themselves through various forms of art and design.",
      "recommendedCareersOpening": "As a Thoughtful Guide, your empathy and creativity make you perfect for roles that involve mentoring, supporting, and inspiring others.",
      "possibleMajors": [
        {
          "link": "",
          "description": "Study the human mind and behavior to better understand and help others.",
          "cipCodes": [
            "4201",
            "4202"
          ],
          "title": "Psychology"
        },
        {
          "link": "",
          "description": "Learn how to support and advocate for individuals and communities.",
          "cipCodes": [
            "4407"
          ],
          "title": "Social Work"
        },
        {
          "link": "",
          "description": "Combine psychology and art to help people express themselves and heal.",
          "cipCodes": [
            "5213"
          ],
          "title": "Art Therapy"
        },
        {
          "link": "",
          "cipCodes": [
            "1301",
            "1302",
            "1312"
          ],
          "description": "Focus on teaching and supporting students of all ages.",
          "title": "Education"
        },
        {
          "link": "",
          "cipCodes": [
            "4400"
          ],
          "description": "Prepare for a career in helping individuals and communities through various support services.",
          "title": "Human Services"
        }
      ],
      "howYouCommunicate": "**Communicating with Friends**: Your friends appreciate your creativity and supportive nature. Make sure to listen to their ideas and build on them together. **Communicating in Romantic Relationships**: In romantic relationships, your empathy and passion are key strengths. Ensure you also express your feelings and understand your partner’s emotions. **Communicating with Family**: Your family values your innovative ideas and enthusiasm. Share your visions with them and also take time to understand their viewpoints. **Effective Communication**: Use visual aids, metaphors, and relatable examples to make your concepts more accessible. Practice active listening to ensure your audience feels heard and understood.",
      "superpowers": " - Empathy: You have a natural ability to understand and share the feelings of others. - Creativity: You excel at generating new and original ideas to help others. - Insightfulness: Your deep understanding of people and situations allows you to provide valuable guidance. - Patience: You are patient and take the time to listen to others, ensuring they feel heard and supported. "
    }
  ]